[{"Conference": "MMMT 2021: International Conference on Machining, Materials and Mechanical Technologies", "Link": "http://www.mmmt2021.org/", "Deadline": "2021-03-22", "Notice": "2021-03-29", "Begin": "2021-03-29", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Shanghai, China", "Categories": null, "CallForPapers": " ---Welcome to MMMT2021----  2021 International Conference on Machining, Materials and Mechanical Technologies (MMMT2021) will take place in Shanghai, China during March 29-30, 2021. It will provide a platform for educators, scholars, managers and graduate students from different cultural backgrounds to present and discuss research, developments and innovations in their academic fields. Sincerely welcome prospective scholars to submit their novel research or technological contributions to MMMT2021 and share their valuable experiences with other scientists and students from all over the world.    ---Paper Publication-----  Papers submitted to MMMT2021 will be reviewed by technical committees of the conference. All accepted and registered papers will be published in the Journal of Materials Science Forum [ISSN print 0255-5476, ISSN web 1662-9752]. And the press will submit all papers to major databases such as EI Compendex, Scopus, SCImago Journal & Country Rank (SJR), Inspec, Cambridge Scientific Abstracts, ProQuest, EBSCO, WorldCat, Google Scholar, and CNKI Scholar and so on. We sincerely invite you to join MMMT2021, and welcome your submitting. For a few authors who don't expect any publication of your papers, you're welcome to submit the abstracts to us which will be sent to at least two technical committees for a brief review, and present your abstract at the conference without publishing.    ----Paper Submission-------  Please send your Paper(s) to MMMT2021 via email:  submit@mmmt2021.org or  mmmt2021@sina.com, the email subject should be named \"Submission+Name+Tel\".   Regular papers are allowed to 6 pages. Extra pages(exceed 6 pages) will incur additional charges. Notice: It is not compulsory for you to attend the conference, it does not affect your paper the publication and indexed.    ----Call for Papers----  All submissions will be blind reviewed by the Technical Committees on the basis of technical quality, relevance to conference topics of interest, originality, significance, and clarity. By submitting your manuscript to the MMMT2021, it is understood that this it is an original manuscript and is unpublished work and is not under consideration elsewhere. Plagiarism, including duplicate publication of the author's own work, in whole or in part without proper citation is not tolerated by the conference.    Topics of interest for submission include, but are not limited to:  1: Materials Science and Engineering      • Computational materials science  • Engineering apllications of materials  • Global materials science market  • Graphene Technology  • Carbon nano structures and devices  • Coatings, surfaces snd membranes  • Biomimetic materials  • Fiber, films and membranes  • Polymeric biomaterials  • Applications of Materials Science  • Emerging Technologies in Materials Science  • Materials Synthesis  • Materials Processing  • Materials Characterization  • Industrial materials  • Materials Physics and Chemistry  • Materials and Design  • Novel Materials, Multifunctional Materials  • Quantum Materials  • Materials Innovation and Development  • Green Technology  • Optoelectric and Magnetic Materials  • 3D/4D Printing Technologies      2: Nanomaterials and Nanotechnology    • Nano-Alloys  • Nano/Meso-Structured Carbon Materials  • Nanostructured Materials  • Nanofabrication  • Functional Nanomaterials  • Nanotechnology for Energy and the Environment  • Nanochemistry  • Green Nanotechnology  • Nano Engineering  • Nanomaterials, biomaterials & synthesis  • Carbon nanotechnology  • Nanochemistry & Wet Nanotechnology  • Nanotechnology in Structural Biology  • Biomaterials and Nano biotechnology  • Organic and Inorganic Nano materials  • Nano devices, Nano electronics and Nano sensors  • Synthesis of nanomaterials and properties  • Thin Films, nanotubes and nanowires  • Carbon nano structures and devices  • Nanoelectronics  • Nano and microfibrillated cellulose  • Micro, nano and bio fluidics      3: Energy Materials    • Materials and Technologies for Energy Conversion.  • Electrochemical energy storage  • Energy Materials: Synthesis and Characterization  • Energy materials storage and fuel Cells  • Materials for hydrogen production  • Hybrid materials for energy storage and conversion  • Fuel Cell Electric Vehicles (FCEV)  • Solar Energy Materials  • Solar Systems Integration  • Concentrating Solar Thermal for Electricity, Chemicals, and Fuels  • Photovoltaic Materials, Devices, Modules, and Systems  • Solar Thermal  • Fuel cells and Biofuels  • Photocatalysis and Electrocatalysis  • Batteries, Supercapacitors and Solid   •Electrolyte Materials  • CO2 Capture, Storage & Conversion  • Bioenergy  • Geothermal Energy  • Renewable Fuels    4: Composite & Ceramic Materials      • Composite & Ceramic Materials: Synthesis and Characterization  • Composite & Ceramic Materials: Structure and Design  • Nano-Composites and Nano-Ceramics  • Ceramic-Matrix Composites  • Polymer Matrix Composites  • Composite & Ceramic Engineering  • Glass Engineering and Science  • Ceramic Coating  • Ceramic Cutting Tools  • Ceramic Films and Coatings  • Ceramic Lasers  • Nanoceramics  • Bioceramics  • Advanced Ceramics  • Brick and Structural Clay  • Refractories  • Ceramic art  • Clay Ceramics  • Structural Ceramics      5: Polymer Science and Technology      • Ring-opening metathesis polymerization  • Biocatalysis, enzyme synthesis, biological organisms for synthesizing monomers and polymers  • Plastics and the Environment  • Biopolymers  • Electrospinning of Carbon Nanotube Reinforced Polymeric Materials  • Lasers in Polymer Science and Technology  • Polymer Matrix Composites and Technology  • Metal Matrix Composites and Technology  • Ceramics Matrix Composites and Technology  • Polymer Chemistry  • Polymer Design and Modelling  • Polymer Nanocomposites  • Advanced Polymer Structures  • Chemical and Mechanical Properties of Polymer  • Polymer Rheology  • Bio-Polymers  • Applications of Polymers  • Recent innovations in Polymer Science and Technologies  • Polymer Industry      6: Composite Materials     • Advanced Composite Materials  • Automotive Composites  • Polymer Composites  • Ceramic Based Composites  • Nanocomposites  • Biocomposites  • Metal matrix Composites  • Polymer matrix Composites  • Ceramic matrix Composites  • Biomedical Composites  • Carbon Matrix Composites  • Multi-functional Composites  • Nanotechnology Composites  • Textile Composites  • Green Composites  • Mechanical Properties  • Composites Manufacturing  • Applications of Composites    7: Surface Science And Engineering      • Thin Films, Materials Surface & Interfaces  • Surface and Interface Phenomena  • Surface and Interface Analysis and Properties  • Nanostructured Materials, Micelles, and Colloids  • Solid Thin Films and Layers  • Thin Film Growth & Epitaxy  • Surface Coating Technology  • Corrosion Engineering  • Tribology  • Surface characterization  • Interfaces and thin films  • Nanostructured materials  • Smart applications of surfaces and interfaces  • Applied Surface Science  • Surfaces and Interfaces  • Coatings and surface treatments    8: Smart Materials And Applications      • Renewable smart materials  • Smart materials and structures  • Graphene-based smart materials  • Smart Functional Nanoenergetic Materials  • Smart building materials and structures  • Smart biomaterials  • Smart Materials and Structures  • Advances in Smart Materials and Applications  • Magnetic smart materials  • Piezoelectrics: Piezoelectric materials convert electrical energy to mechanical energy, and vice versa.  • Shape Memory Alloys  • Magnetostrictive  • Shape Memory Polymers  • Electroactive Polymers  • Bi-Component Fiber  • Semiconductor Photocatalysis      9: Advanced Materials and Nanotechnology     • Advanced Engineering Materials  • Advanced Functional Materials  • Advanced Energy Materials  • Advanced Healthcare Materials  • Advanced Optical Materials  • Advanced Materials Interfaces  • Advanced Electronic Materials  • Advanced Materials Technologies    Track 10: Mechanical Engineering    •Precision mechanics, mechatronics  • Mechanical Manufacturing and automation   • Mechanics of Applied-Statics and Dynamics   • Mechanics of Solid   • Mechanical-electronic engineering   • Mechanical power engineering   • Mechanical Technologies    • Dynamics of Mechanical Systems    • Material shaping and controlling engineering  Last updated by Julie  Julia  in 2021-03-11 "}, {"Conference": "ARCS 2021: International Conference on Architecture of Computing Systems", "Link": "https://arcs-conference.org/", "Deadline": "2021-03-22", "Notice": "2021-05-10", "Begin": "2021-06-07", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Online", "Categories": null, "CallForPapers": " Topics of Interest    A wide range of HW/SW aspects of “Advanced Computing Architectures” including (but are not limited to):        Hardware Architectures          (3D) System-on-chip          Distributed systems          Multi- and many-core architectures          Heterogeneous computing          (Runtime) reconfigurable architectures          Advanced computing architectures          Emerging memory technologies      Programming Models and Runtime Environments          Domain-specific languages and programming models          Operating systems, hypervisors and middleware for homogeneous and heterogeneous multi-/many-core computing platforms          System management including but not limited to scheduling, memory management, power/thermal management, and RTOS      Cross-sectional Topics          Adaptive systems (energy aware, self-x technologies)          Pervasive systems          Autonomous systems          Mixed-criticality systems          Organic Computing          Approximate Computing          Support for safety and security  Last updated by Dou Sun in 2021-03-14 "}, {"Conference": "CAIC 2021: International Conference on Control, Automation and Intelligent Computing", "Link": "http://www.caic2021.org/", "Deadline": "2021-03-23", "Notice": null, "Begin": "2021-05-28", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Beijing, China", "Categories": null, "CallForPapers": " 2021 International Conference on Control, Automation and Intelligent Computing (CAIC2021) is an excellent forum for people who have certain research in this filed. Prospective authors are cordially invited to participate this conference by submitting papers to us. There are some related topics for reference. Topics for submission include, but not limited to:    Topic 1: Control  Control of Biological Systems  Precision Motion Control  Control Applications  Control Engineering Education  Industrial Process Control  Automated Guided Vehicles  Control Theory and Applications Optoelectronics  Instruments and Vibration Control  Intelligent and AI Based Control  Material Processing and Control  Process Control & Instrumentation  Sensor Networks and Networked Control  Adaptive Control  Robust Control  Process Control  Networked Control Systems  Complex Systems  Co-operative Control  Precision Motion Control  Identification and Estimation  Fault Detection    Topic: 2: Automation  Factory Modeling and Automation  Process Automation  Intelligent Automation  Home, Laboratory and Service Automation  Manufacturing Control and Automation Engineering  Man-machine Interactions  Factory Modeling and Simulation  Nano-scale Automation and Assembly  Instrumentation Systems  Network-based Systems  Planning, Scheduling and Coordination  Biomedical Instrumentation and Applications  Discrete Event Systems  Hybrid Systems  Delay Systems  Nonlinear Systems  Intelligent Systems  Real-time Systems  Flexible Manufacturing Systems  Fuzzy Systems  Modeling of Complex Systems    Topic 3: Intelligent Computing  Algorithms and Theories  Artificial Intelligence  Internet & Cloud Computing  Web and Internet Computing  Bioinformatics Algorithms & Databases Biostatistics  Nature Inspired Computing and Optimization  Computational Neuroscience  Evolutionary Computation and Learning  Big Data Processing in Biology  Genetic Algorithms  Evolutionary Computation and Control  Optimization Algorithms  Soft Computing  Software Agents for Intelligent Control Systems  Neural Networks based Control Systems  Robotics and Automation  Network Robotics  Robot Design, Development and Control  Control and Supervision Systems  Vehicle Control Applications  Human-Robots Interfaces    Other Related Topics  Last updated by CAIC 2021 in 2021-03-11 "}, {"Conference": "KR 2021: International Conference on the Principles of Knowledge Representation and Reasoning", "Link": "https://kr2021.kbsg.rwth-aachen.de/", "Deadline": "2021-03-24", "Notice": "2021-06-15", "Begin": "2021-11-06", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "N/A", "Location": "Hanoi, Vietnam", "Categories": null, "CallForPapers": " Knowledge Representation and Reasoning (KR) is a well-established and lively field of research. In KR a fundamental assumption is that an agent's knowledge is explicitly represented in a declarative form, suitable for processing by dedicated reasoning engines. This assumption, that much of what an agent deals with is knowledge-based, is common in many modern intelligent systems. Consequently, KR has contributed to the theory and practice of various areas in AI, including automated planning and natural language understanding, and to fields beyond AI, including databases, verification, software engineering, and robotics. In recent years, KR has contributed also to new and emerging fields, including the semantic web, computational biology, cyber security, and the development of software agents.     The KR conference series is the leading forum for timely in-depth presentation of progress in the theory and principles underlying the representation and computational management of knowledge.     Scope     We solicit papers presenting novel results on the principles of KR that clearly contribute to the formal foundations of relevant problems or show the applicability of results to implemented or implementable systems. We also welcome papers from other areas that show clear use of, or contributions to, the principles or practice of KR.     Topics of interest include, but are not limited to:     Applications of KR   Argumentation   Belief revision and update, belief merging, information fusion   Commonsense reasoning   Computational aspects of knowledge representation   Concept formation, similarity-based reasoning   Contextual reasoning   Decision making   Description logics   Explanation finding, diagnosis, causal reasoning, abduction   Geometric, spatial, and temporal reasoning   Inconsistency- and exception-tolerant reasoning, paraconsistent logics   KR and autonomous agents and multi-agent systems   KR and cognitive robotics   KR and cyber security   KR and education   KR and game theory   KR and machine learning, inductive logic programming, knowledge acquisition   KR and natural language processing and understanding   KR and the Web, Semantic Web   Knowledge graphs and open linked data   Knowledge representation languages   Logic programming, answer set programming   Modeling and reasoning about preferences   Multi- and order-sorted representations and reasoning   Nonmonotonic logics, default logics, conditional logics   Ontology formalisms and models   Ontology-based data access, integration, and exchange   Philosophical foundations of KR   Qualitative reasoning, reasoning about physical systems   Reasoning about actions and change, action languages   Reasoning about constraints, constraint programming   Reasoning about knowledge, beliefs, and other mental attitudes   Uncertainty, vagueness, many-valued and fuzzy logics  Last updated by Dou Sun in 2021-01-19 "}, {"Conference": "ICMET 2021: International Conference on Mechanical and Electrical Technology", "Link": "http://www.icmet.ac.cn", "Deadline": "2021-03-25", "Notice": null, "Begin": "2021-04-02", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Tokyo, Japan", "Categories": null, "CallForPapers": " Topics Include    1. Mechanical and Mechatronics Engineering and Technologies  • 1.1 Mechanics  • 1.2 Mechatronics and robotics  • 1.3 Structural analysis  • 1.4 Thermodynamics and thermo-science  • 1.5 Design and drafting  • 1.6 Biomechanics  • 1.7 Micro- and Nano-Systems Engineering and Packaging  • 1.8 Systems, Design, and Complexity  • 1.9 Transportation Systems  • 1.10 Vibration, Acoustics and Wave Propagation    2. Electrical Engineering  • 2.1 Integrated Circuits & Power Electronics  • 2.2 Energy Harvesting & Conversion  • 2.3 Optics, Nanophotonics & Quantum Tech  • 2.4 Nanotechnology & NEMS/MEMS  • 2.5 Electronic Devices and Instrumentation  • 2.6 Energy-Efficient Hardware Systems  • 2.7 Control & Optimization  • 2.8 Microelectronics  • 2.9 Circuits and Systems  • 2.10 Electrical Machines and Drive Systems  • 2.11 Electric Vehicle Technologies  • 2.12 High Voltage and Insulation Technologies  • 2.13 Drive Systems  • 2.14 Power Quality and Electromagnetic Compatibility  • 2.15 Power System Reliability and Security  • 2.16 Power Systems Communication  • 2.17 Semiconductor Technology  Last updated by Dou Sun in 2021-03-14 "}, {"Conference": "MEIE 2021: International Conference on Mechanical, Electric and Industrial Engineering", "Link": "http://www.icmeie.com/", "Deadline": "2021-03-25", "Notice": null, "Begin": "2021-05-22", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "N/A", "Location": "Kunming, China", "Categories": null, "CallForPapers": " The Fourth International Conference on Mechanical, Electric and Industrial Engineering (MEIE2021) will be held in Kunming, China during May 22-24, 2021.    MEIE2021 aims to provide an annual platform for scholars, experts and researchers from worldwide, to exchange their experiences and latest findings in the fields of mechanical engineering, electric engineering or industrial engineering. All full paper submitted to the MEIE2021 will be peer reviewed and evaluated based on originality, technical, research content, research depth, correctness, relevance to conference, contributions and readability.    On behalf of the organizing committee, we cordially invite researchers, engineers, academicians as well as industrial professionals to participate in MEIE2021.     The papers may include but are not limited to:    Mechanical:  Biomechanics  Robotics  General Mechanics  CAD/CAM/CIM  Structural Analysis  Fuels and Combustion  Dynamics and Vibration  Computational Fluid Dynamics  Design and Drafting  Acoustic Engineering  Machinery and Machine Design  Fluid Mechanics and Machinery  Mechanical and Electrical Integration  Thermodynamics  Mechanical Power Engineering  Applied Mechanics    Electric:  Microelectronics  Signals and Systems  Electrical Machinery  Power System Analysis  Automatic Control Principle  Automatic Control System  Electronic Circuits  Insulation Technology  Microcomputer Principle and Application  Power Electronic Technology  Analog Electronic Technology  Electromagnetic and Photonics  Microcomputer Control Technology  Digital Electronic Technology  Electrical Control Technology  HVDC Transmission Technology  High Voltage Technology    Industrial Engineering:  Ergonomics  Industrial Simulation  Process Engineering  Engineering Design  Industrial Manufacturing Design  Quality Engineering  Systems Engineering  Manufacturing System Engineering    Note:    The submitted paper must be original and unpublished. Any manuscripts out of the conference's scope, containing plagiarism (including self-plagiarism) or be in considered by other journal will be rejected.  Last updated by Dou Sun in 2020-08-06 "}, {"Conference": "CCAI 2021: International Conference on Computer Communication and Artificial Intelligence", "Link": "http://www.ccai.net", "Deadline": "2021-03-25", "Notice": "2021-04-10", "Begin": "2021-05-07", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Guangzhou, China", "Categories": null, "CallForPapers": " The CCAI 2021 is the premier interdisciplinary platform for the presentation of new advances and research results in the fields of Computer Communication and Artificial Intelligence. The conference will bring together leading academic scientists, researchers and scholars in the domain of interest from around the world.     Topics of interest for submission include, but are not limited to:    Computer Communication        Artificial Intelligence and Machine Learning      Blockchain Technology      Computer Architecture      High-Performance Computing      Information and Its Technical Education      Mobile and Ubiquitous Computing      Parallel and Distributing Computing      Software Engineering and Knowledge Engineering      Virtual Reality and Visualization      Autonomic and Trusted Computing      AI in Communication      Big Data      Biomedical Informatics and Computation      Data Compression      Image Processing      Mobile Computing      Network Security and Cryptography      Robotics Technology      Knowledge Discovery and Data Mining      Wireless and Sensor Devices      RF and Microwave Communication      Microwave Theory and Techniques      Integrated Optics and Electro-optics Devices      Signal, Image and Video Processing      Network Communication and many more      RF, Microwave and millimeter circuit      Electromagnetic and Photonics      Signal Detection and Parameter Estimation      Communications Transmission      Antenna and Propagation      Remote Sensing and GPS      Techniques of Laser and Applications of Electro-optics      Wireless Communications      RF and Microwave devices      Modulation, Coding, and Channel Analysis      Optical Electronic Devices & Photonics      Speech and Audio Processing    Artificial Intelligence        Artificial Intelligence and Technology      Natural Language Processing      Computer Vision      Bioinformatics      Robotics and Related Fields      Expert Systems      Multi-agent Systems      Speech Understanding      Knowledge Engineering      Distributed Intelligent Processing      Concurrent and Parallel Processing      Intelligent Database Systems      Supervised and Unsupervised Learning      Neural Network Theory and Architectures      Hardware Implementations      Fuzzy Logic      Fuzzy Optimisation      Fuzzy Control      Fuzzy Computing with Words      Theory of Evolutionary Algorithms      Evolutionary Design      Evolutionary Scheduling and Optimisation      Rough Sets Theory: Foundations and Applications      Data Mining      Artificial Intelligence in Scheduling and Optimization      Artificial Intelligence in Modelling and Simulation      Various Applications  Last updated by Dou Sun in 2021-03-14 "}, {"Conference": "ICTC' 2021: Information Communication Technologies Conference", "Link": "http://www.ictc.net/", "Deadline": "2021-03-25", "Notice": "2021-04-10", "Begin": "2021-05-07", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Nanjing, China", "Categories": null, "CallForPapers": " - Track 1: Quantum Computing and Blockchain, Queuing and Storage -    - Track 2: next generation communication and networking -    Networking for Cloud and Fog computing  Mobile Cloud Computing (MCC) and Multi-access Edge Computing (MEC)  Data center network architectures and performance  Software Defined Networking (SDN) and Network Function Virtualization (NFV)  NFV Management and Orchestration  Information Centric Networking (ICN)/ Named Data Networking (NDN)  Internet of Things (IoT), M2M, D2D, MTC  Content-centric networking: caching, naming, distribution, load balancing, resiliency, traffic engineering, congestion control  Future Internet and next-generation networking architectures  High speed and programmable architectures for next generation routers and switches  Mobile security: device, application, and data  Next-generation anomaly, intrusion, and attack detection/prevention  Heterogeneous multi-layer and multi-domain wireless-wireline internetworking  Free space optical (FSO) networks and Visible light communication (VLC)  Indoor localization and navigation  Intent-based network control and management  Internet economics, pricing, accounting, and growth modelling  Internet and network outages, robustness, survivability, and resilience  Integrated networking, storage, and computing  Networking flying vehicles such as UAVs and drones  Networked and Cloud Robotics  Next-generation access networks  Next-generation flow management: resource sharing, congestion control  Next-generation Internet applications and services, including virtual/augmented reality, interactive media, voice and video, games, and immersive applications  Next-generation IP multimedia subsystem: architecture and design  Next-generation networking protocols  Next-generation network management and control  Open Communities, Open API, Open Source  Operational and research issues with IPv6  Overlay and peer-to-peer (P2P) networking  Packet classification and forwarding mechanisms at ultra-high link rates  Quality of Service (QoS) and Quality of Experience (QoE) in next-generation networks  Resource orchestration in next-generation networks  Self-protection and self-organization networking  Addressing and naming with the presence of mobility and portability  Centralized-RAN, Could-RAN, and Fog-RAN architectures  Converged networks and applications    - Track 3: Communication, network and hardware -    Network Interface Virtualization  Network Virtualization Concept and Architecture  Green Datacenter  Higher layers of protocols, application  Physical and link layers and lower layers of protocols  Simulation, Modeling and analysis and performance evaluations  Network management and services  Optical Passive and Active components and devices  Security in Mobile and Wireless Networks  WLAN and Mobile WIMAX, 3G and 4G systems  Wireless Local Loop (WLL)  Multiple Access Technology  Broadband Wireless Access  Wireless Multimedia Services  Cost-effective Rural, Urban and Community Wireless and Mesh Networks  Networking and computing in challenged environment  Policies for communication access development  Sensor networks / alert systems  Mobile-based computing  Wireless, ad-hoc, meshed, etc. networks    - Track 4: Fuzzy Logic and Soft-Computing (Special Session) -    Soft Computing based Hybrid Systems  Fuzzy Set and Fuzzy Logic Theory  Neurocomputing  Chaotic Computing  Evolutionary Computing  Fuzzy Data Science  Decision Making with Imperfect Information  Applications of Fuzzy Logic and Soft computing in Economics, Engineering, Medicine, Business etc.    - Track 5: Data Science and Advanced Analytics -    Advanced Statistical Analytics  Software Techniques and Architectures in Cloud/Grid/Stream Computing  Domain-Specific Applications of Data Analytics  Programming Models and Environments for Cluster, Cloud, and Grid Computing to Support Big Data  MapReduce-based Solutions  New Computational Models for Big Data  Data Visualization at Scale  Forecast of Time Series  Game Data Science  Big Data Open Source Platforms  New Programming Models for Big Data beyond Hadoop/MapReduce  Software Systems to Support Big Data Computing  Data Management in the Social Web  Big Data as a Service  Big Data Industry Standards  Large-Scale data Management and Analysis  Big Data and Mobility  Big Data Analytics in Government, Public Sector and Society in General  Complex Big Data Applications in Verious Areas  Data-intensive Computing and MapReduce    - Track 6: Big Data Engineering -    Hadoop as a Large-scale Data-processing Technology  Text Mining and Analysis  New Data Standards  Semantic-based Data Mining and Data Pre-processing  Machine Learning and Data Mining  Social Web Search and Mining  Data Stream Processing at Scale  Data Pre-processing, Cleaning, Normalization  Auditing Big Data Sources  Large Scale Optimization  NoSQL as a new Database Paradigm  Data and Information Quality for Big Data  Visualization and Data Mining  Web-Mining  Mining Social Media  Business Intelligence and Data Mining  Social network analysis, theories, models, and applications  Algorithms and systems for Web-scale mining  Natural Language Processing and Information Retrieval  Unstructured Information Extraction from the Web    - Track 7: High Performance Computing and Machine Learning -    Parallel and Distributed Computing and Systems  Cluster and Grid Computing  Peer-to-Peer Architectures and Networks  High Performance Interconnection Networks  Partitioning, Mapping, and Scheduling  Load Balancing and Sharing  Fault Tolerance and Resilience in HPC Systems  Benchmarking and Performance Assessment in HPC  Virtualization and Virtual Machines  Learning and Intelligence Algorithms  Artificial Intelligence and Machine Learning at Scale  Machine Learning on GPUs, TPUs, CPUs  Deep Learning Techniques  Computer Vision and Pattern Recognition  Autonomous Vehicle Navigation  Facial Recognition and Expression Detection  Machine Learning in Robotics and Automation  Open Source Tools for Artificial Intelligence  Neural Networks and Deep Learning  Speech & Pattern Recognition    - Track 8: Cyber Security Issues -    High Performance Cryptography  Visualizing Large Scale Security Data  Privacy Preserving Big Data Collection/Analytics  Secure Software Development  Computer Network Security  Mobile Smart Phone and Tablet Security  The Nature of Web Application Hacking and New Security Trends  Web Application Security Solutions and Best Practices  Mobile Applications and Security  Security Threats and Vulnerabilities  National Approaches and Policies in Cyber Security  Cyberconflicts: Models and Deterrence Mechanisms  Deep Understanding of and Practical Skills in Software Security  Infusing Information Security into the Software-Development Life Cycle  Cloud Computing and Security  Government Cyber Security Strategy  Cyber Security Trends  Information Security Compliance, Regulations and Legislation  Security Policy Formulation and Implementation  Governance Risk and Compliance  Web/Internet Security    - Track 9: Emerging Trends and Technologies in ICT Application -    Web-based system  Green IT Technologies  Virtualization Concept  Social Applications  GIS and Remote Sensing  Distributed and Parallel Computing Information System Tools, Standards, Architectures, Platforms  Advanced database and Web Applications  Cloud Computing  Distributed Processing  Decision Support Systems  Concepts and Development of Information Systems  New SPI Models: SaaS, PaaS, IaaS, CaaS, XaaS  Location and mobility semantics  Social Network Analysis Methods and Applications  Context-aware Computing and Location-based Services  Web2 and Web3 new development paradigm  Web Ontology and Development  Semantic Web: Concepts, Technologies and Applications  Augmented Reality  Service Oriented Architechture    - Track 10: ICT in Business Administration, Governance, Finance and Economy -    ICT for micro/small businesses  e-Planning  Business process management, re-engineering and modelling  Metadata and public standards  Business Models and Economics of Community and Rural Wireless Networks  Internet as base of distributed business models  Location and Context Management  Data Science and Business Intelligence  Scientific fundament of e- and m-Commerce    - Track 11: ICT in Education and Research -    Human-Computer Challenge and Interaction  Public Access to Information and Globalization  Different Approaches to Implementation of ICT in S&T Education  Industry-University Partnership  Knowledge Management in e-Learning  Virtual Classrooms, and Universities  Learning & Content Management Systems  Mobile Learning Applications  e-Learning Platforms and Tools  Information Technologies in HE Management and Administration    - Track 12: ICT in Medicine and Health Care -    Healthcare Management Systems  Human-Machine Interfaces for Disabled Persons  Mobile technologies for Healthcare applications  Support for clinical decision-making  Design and development methodologies for Healthcare IT  e-Health and Telemedicine    - ICT in Fuel and Energy Industry -    Power systems and Automation  Thermal Power Engineering  Engineering Aspects of Alternative/Renewable Energy  Energy conservation and Energy efficient systems  Technology of production, exploration and operation in Fuel and Energy Industry  Fuzzy control in Fuel and Energy Industry  Neural networks in Fuel and Energy Industry  Integrated control and Diagnostics  Smart systems in Oil and Gas Technologies  Last updated by Dou Sun in 2021-03-07 "}, {"Conference": "BDE 2021: International Conference on Big Data Engineering", "Link": "http://www.bde.net/", "Deadline": "2021-03-25", "Notice": "2021-04-15", "Begin": "2021-05-29", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Shanghai, China", "Categories": null, "CallForPapers": " The BDE 2021 organized by the ACM Singapore Chapter will present the most recent and exciting advances in Big Data Engineering through keynote talks. Prospective authors are invited to submit papers on relevant algorithms and applications including, but not limited to:    Big Data Science and Foundations  Novel Theoretical Models for Big Data  New Computational Models for Big Data  Data and Information Quality for Big Data  New Data Standards    Big Data Infrastructure  Cloud/Grid/Stream Computing for Big Data  High Performance/Parallel Computing Platforms for Big Data  Autonomic Computing and Cyber-infrastructure, System Architectures, Design and Deployment  Energy-efficient Computing for Big Data  Programming Models and Environments for Cluster, Cloud, and Grid Computing to Support Big Data  Software Techniques and Architectures in Cloud/Grid/Stream Computing  Big Data Open Platforms  New Programming Models for Big Data beyond Hadoop/MapReduce, STORM  Software Systems to Support Big Data Computing    Big Data Management  Search and Mining of variety of data including scientific and engineering, social, sensor/IoT/IoE, and multimedia data  Algorithms and Systems for Big Data Search  Distributed, and Peer-to-peer Search  Big Data Search Architectures, Scalability and Efficiency  Data Acquisition, Integration, Cleaning, and Best Practices  Visualization Analytics for Big Data  Computational Modeling and Data Integration  Large-scale Recommendation Systems and Social Media Systems  Cloud/Grid/Stream Data Mining- Big Velocity Data  Link and Graph Mining  Semantic-based Data Mining and Data Pre-processing  Mobility and Big Data  Multimedia and Multi-structured Data- Big Variety Data    Big Data Search and Mining  Social Web Search and Mining  Web Search  Algorithms and Systems for Big Data Search  Distributed, and Peer-to-peer Search  Big Data Search Architectures, Scalability and Efficiency  Data Acquisition, Integration, Cleaning, and Best Practices  Visualization Analytics for Big Data  Computational Modeling and Data Integration  Large-scale Recommendation Systems and Social Media Systems  Cloud/Grid/StreamData Mining- Big Velocity Data  Link and Graph Mining  Semantic-based Data Mining and Data Pre-processing  Mobility and Big Data  Multimedia and Multi-structured Data-Big Variety Data    Big Data Security, Privacy and Trust  Intrusion Detection for Gigabit Networks  Anomaly and APT Detection in Very Large Scale Systems  High Performance Cryptography  Visualizing Large Scale Security Data  Threat Detection using Big Data Analytics  Privacy Threats of Big Data  Privacy Preserving Big Data Collection/Analytics  HCI Challenges for Big Data Security & Privacy  User Studies for any of the above  Sociological Aspects of Big Data Privacy  Trust management in IoT and other Big Data Systems    Big Data Applications  Complex Big Data Applications in Science, Engineering, Medicine, Healthcare, Finance, Business, Law, Education, Transportation, Retailing, Telecommunication  Big Data Analytics in Small Business Enterprises (SMEs)  Big Data Analytics in Government, Public Sector and Society in General  Real-life Case Studies of Value Creation through Big Data Analytics  Big Data as a Service  Big Data Industry Standards  Experiences with Big Data Project Deployments  Last updated by Dunn Carl in 2021-02-26 "}, {"Conference": "ICKEA 2021: International Conference on Knowledge Engineering and Applications", "Link": "http://www.ickea.org/", "Deadline": "2021-03-25", "Notice": "2021-04-15", "Begin": "2021-06-04", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Bangkok, Thailand", "Categories": null, "CallForPapers": " The Conference organizing committee invites researchers worldwide to submit papers and share the valuable experiences with the scientists from the world.    Knowledge Technology and Applications  Advanced Knowledge Technologies  Knowledge Relationship Discovery  Knowledge Representation and Reasoning  Knowledge Services  Knowledge Visualization  Learning organization & organizational learning  Metadata and structured documents  Ontology Engineering and Technology  Ontology matching and alignment  Ontology sharing and reuse  Organizational memories  Organizational semiotics  Process knowledge and semantic services  Semantic Web and Ontology  Social networks and the psychological dimension  Studies, metrics & benchmarks  Tools and technology for knowledge management  e-Learning, e-training and executive training  Decision support systems and intelligent systems    Human-Machine Interaction  Impact measurement of knowledge management  Innovative Approaches to Knowledge Management  Intelligent information systems  Intelligent multi-agent systems  Intelligent problem solving  Interoperability  K-Economy, k-community and k-enterprise  Knowledge acquisition  Knowledge Management and Projects  Knowledge Management strategies and implementations  Knowledge Reengineering  Business intelligence & Customer Relationship Management  Communication, collaboration and information sharing  Content management & digital rights management  Context modeling and management  Digital libraries, Archives and Repositories  Domain analysis and modeling  e-Business and interoperability issues  Last updated by Dou Sun in 2021-03-07 "}, {"Conference": "ICTDM 2021: International Conference on Communication Technology and Data Mining", "Link": "http://www.ictdm.org/", "Deadline": "2021-03-25", "Notice": "2021-04-15", "Begin": "2021-07-29", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Hangzhou, China", "Categories": null, "CallForPapers": " 2021  International Conference on Communication Technology and Data Mining (ICTDM 2021) is the premier forum for the presentation of new advances and research results in the fields of Communication Technology and Data Mining. The conference will bring together leading researchers, engineers and scientists in the domain of interest from around the world. Topics of interest for submission include, but are not limited to:    1.Communication Technology Topics:    Network and Wireless Communication  VLSI Circuits and Systems Design  Information Hiding and Watermarking  Multimedia  Network and Information Security  RF Front-End Circuits and Systems  Intelligent Mobile Device Design  Coding and Signal Processing  Wearable Technology  Microwave/MM-Wave/THz Circuits and Syste  Internet of Things and Big data  Computer Vision and Artificial Intelligence  5G Communication and Network  Green Communication Systems  Communication Device Modeling  EMC and Antenna Design  Others    2.Core Data Mining Topics:    Data Pre-Processing  Data Transformation and Dimensionality Reduction  Feature Extraction and Feature Selection  Data Mining Algorithms  Data Analytics Foundations  Real-time Mining, Data Stream Mining, and Dynamic Data Mining  Visual Mining and Data Visualization  Statistical Learning Theory and Neural Network Research  Graph Mining and Semi-Structured Data  Spatial and Temporal Data Mining  Uncertainty Modeling in Data Mining  Web Mining    3.Data Mining For Intelligent IT Application Topics:    Convergence of Data Mining and Intelligent IT Applications  How Data Mining Techniques have been used in IT Applications  Novel Applications of Intelligent IT Techniques for Complex Systems  Robustness and Scalability Issues of Intelligent IT Techniques  Agent-based Data Analysis and Knowledge Discovery  Intelligent Multi-gent Systems  Intrusion Detection and Access Control Techniques  Data-mining Applications for Terrorist Network Tracing  Crime Modeling, Fraud and Misuse Detection  Credit Scoring, Financial Modeling and Forecasting  CRM, e-Marketing and e-Commerce Recommender  Web Intelligence  Prediction Systems  Knowledge Management  Decision Analysis and Decision Support Systems  Industrial Applications of Business Analytics and Optimization  Performance Evaluation in Intelligent IT applications  Emerging Intelligent IT Applications and Lessons Learned  Last updated by Hana Liu in 2021-02-24 "}, {"Conference": "ATCES 2021: International Conference on Aerospace Technology, Communications and Energy Systems", "Link": "https://www.atces.org/", "Deadline": "2021-03-25", "Notice": "2021-04-25", "Begin": "2021-09-23", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "N/A", "Location": "Shanghai, China", "Categories": null, "CallForPapers": " ATCES 2021 is the premier interdisciplinary forum for the presentation of new advances and research results in the fields of Aerospace Technology, Communications and Energy Systems. The conference will bring together leading academic scientists, researchers and scholars in the domain of interest from around the world. The topics of conference are included below, but not limited to :    Aerospace Technology      Aircraft Structure and Design;    Spacecraft Structure and Design;  Aircraft Manufacturing Technology;    Aerospace Engineering;  Aerodynamics;    Reliability issues of engines, power supply units and their systems;  Development prospects and use of engines for aviation, rocket and space systems, automotive engineering and stationary power supply units;    Computer-aided design, engineering and manufacturing in engines development;  Re-engineering of aircraft engines;    Operation processes and engines theory;  Environmental issues for aviation, energy development and space booster;    Production and advanced technologies of propulsion engineering;  Power units and supply systems control;    Aerospace Systems and Technology;  Aerodynamics and Aeroelasticity;    Aerospace Dynamics and Controls;  Aerospace Propulsion; Aerospace Structures;    Aerospace Design, Testing, and Performance;  Airworthiness and Certifications;    Experimental Methods and Measurements;  UAV and MAV;    Flight Systems;  Aircraft Structure and Design;    Spacecraft Structure and Design;    Communications      Communication Networks;    Wireless Communications;  Mobile Communications;    Infrastructure;  Next Generation Networks;    Information & Communication;  Coding Theory;    Optical Communications;  Internet Technologies;    Communication Software;  Sensor Networks; New;    Communication Technologies;  Visual Arts & Visual Communication Design;    Marketing Communication;  Green Communication;    Communication Systems;  Telecommunication Technologies;    Data Communications;  Information Technology Application;    Satellite Communication;  Network Security;    DSP Algorithms & Architectures;    Energy Systems      Modern Energy Systems and Power Electronics;    Renewable Energy Systems and Distributed Generation;  Renewable Energy Systems;    Hybrid Power Systems;  Intelligent Control for Renewable;    Energy Systems;  Maximum Power Point Tracking (MPPT);    Power Electronics in Distributed Generation;  Intelligent and Adaptive Systems in Smart Grid;    Power System Management;  Last updated by Dou Sun in 2020-10-17 "}, {"Conference": "WiSec 2021: ACM Conference on Security and Privacy in Wireless and Mobile Networks", "Link": "https://sites.nyuad.nyu.edu/wisec21/", "Deadline": "2021-03-25", "Notice": "2021-04-29", "Begin": "2021-06-28", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Online", "Categories": null, "CallForPapers": " The 14th ACM Conference on Security and Privacy in Wireless and Mobile Networks (ACM WiSec 2021) will be held virtually from June 28 to July 1, 2021.    ACM WiSec is the leading ACM and SIGSAC conference dedicated to all aspects of security and privacy in wireless and mobile networks and their applications. In addition to the traditional ACM WiSec topics of physical, link, and network layer security, we welcome papers focusing on the increasingly diverse range of mobile or wireless applications such as Internet of Things, Cyber-Physical Systems, as well as the security and privacy of mobile software platforms, usable security and privacy, biometrics, and cryptography.    The conference welcomes both theoretical as well as systems contributions. Topics of interest include, but are not limited to        Cryptographic primitives for wireless and mobile security      Data-driven security attacks and countermeasures      Economics of mobile security and privacy      Jamming attacks and defenses      Key management (agreement or distribution) for wireless or mobile systems      Lightweight cryptography primitives and protocols      Mobile malware and platform security      NFC and smart payment applications      Next generation cellular network fraud and security      Physical tracking security and privacy      Resilience and dependability for mobile and wireless networks      Reverse engineering of and tampering with mobile applications      Security and privacy for cognitive radio and dynamic spectrum access systems      Security and privacy for mobile applications (e.g., mobile sensing systems)      Security and privacy for smart devices (e.g., smartphones)      Secure localization and location privacy      Security protocols for wireless networking      Side-channel and fault attacks on smart devices      Side-channel attacks on mobile and wearable systems      Theoretical and formal approaches for wireless and mobile security      Usable mobile security and privacy      Vehicular networks security (e.g., drones, automotive, avionics, autonomous driving)      Wireless and mobile privacy and anonymization techniques      Wireless or mobile security for cyber-physical systems (e.g, healthcare, smart grid) and IoT systems      Wireless network security for critical infrastructures    The proceedings of ACM WiSec, sponsored by SIGSAC, will be published by the ACM.  Last updated by Dou Sun in 2021-03-20 "}, {"Conference": "PaCT' 2021: International Conference on Parallel Computing Technologies", "Link": "http://ssd.sscc.ru/conference/pact2021/", "Deadline": "2021-03-25", "Notice": "2021-05-14", "Begin": "2021-09-13", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "N/A", "Location": "Kaliningrad, Russia", "Categories": null, "CallForPapers": " The Institute of Computational Mathematics and Mathematical Geophysics (Russian Academy of Sciences, Novosibirsk, Russia), Immanuel Kant Baltic Federal University, Novosibirsk State University, and Novosibirsk State Technical University are jointly organizing the 16th International Conference on Parallel Computing Technologies (PaCT-2021) to be held in Kalininrad, Russia, September 13-18, 2021.    The proceedings of previous PaCT conferences are available as volumes of Lecture Notes in Computer Science series (Springer) since 1995: https://link.springer.com/conference/pact.     The aim of the PaCT-2021 is to give an overview of new developments, applications, and trends in parallel computing technologies. We sincerely hope that the conference will help our community to deepen understanding of parallel computing technologies by providing a forum for an exchange of views between scientists and specialists from all over the world. We welcome your active participation.    Main topics        All technological aspects of the applications of parallel computer systems      High level parallel programming languages and systems      Methods and tools for parallel solution of large-scale problems      Languages, environments and software tools supporting parallel processing      Operating systems, scheduling, mapping, load balancing      General architectural concepts      Cellular automata      Performance measurement and analysis tools      Active knowledge and program construction      Software for grid and cloud computing      Scalable computing      Fragmentation and aggregation of algorithms and programs      Programs assembling and reuse      Distributed algorithms  Last updated by Dou Sun in 2021-03-06 "}, {"Conference": "INTERSPEECH 2021: Conference of the International Speech Communication Association", "Link": "https://www.interspeech2021.org/", "Deadline": "2021-03-26", "Notice": "2021-06-02", "Begin": "2021-08-30", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "N/A", "Location": "Brno, Czechia", "Categories": null, "CallForPapers": " INTERSPEECH is the world’s largest and most comprehensive conference on the science and technology of spoken language processing. INTERSPEECH conferences emphasize interdisciplinary approaches addressing all aspects of speech science and technology, ranging from basic theories to advanced applications.    The theme of INTERSPEECH 2021 held in Brno, Czechia, is “Speech everywhere”. Speech is also becoming an indispensable part of all AI systems and no longer considered an isolated block. We are seeing the emergence of larger systems that treat speech, vision, language, interfaces, external knowledge in an integrated way, and learn multi-modal embeddings, or otherwise jointly optimize performance. “Speech everywhere” also requires speech engineering to become more aware of the principles of human speech communication processes, and we therefore specifically encourage contributions in human speech processing.    In addition to regular oral and poster sessions, INTERSPEECH 2021 will feature plenary talks by internationally renowned experts, tutorials, special sessions and challenges, show & tell sessions, and exhibits. A number of satellite events will also take place around INTERSPEECH 2021.    Paper Submission    Papers intended for INTERSPEECH 2021 should be up to four pages of text. An optional fifth page can be used for references only. Paper submissions must conform to the format defined in the paper preparation guidelines and as detailed in the author’s kit on the conference webpage. Submissions may also be accompanied by additional files such as multimedia files. Authors must declare that their contributions are original and have not been submitted elsewhere for publication. Papers must be submitted via the online paper submission system. The working language of the conference is English, and papers must be written in English.    Scientific Area Topics    Original papers are solicited in, but not limited to, the following areas:        Speech Perception, Production and Acquisition      Phonetics, Phonology, and Prosody      Analysis of Paralinguistics in Speech and Language      Speaker and Language Identification      Analysis of Speech and Audio Signals      Speech Coding and Enhancement      Speech Synthesis and Spoken Language Generation      Speech Recognition — Signal Processing, Acoustic Modeling, Robustness, Adaptation      Speech Recognition — Architecture, Search, and Linguistic Components      Speech Recognition — Technologies and Systems for New Applications      Spoken Dialog Systems and Analysis of Conversation      Spoken Language Processing — Translation, Information Retrieval, Summarization, Resources and Evaluation      Speech, voice, and hearing disorders (Please note this new area!)  Last updated by Dou Sun in 2021-01-03 "}, {"Conference": "EW 2021: European Wireless", "Link": "https://ew2020.european-wireless.org/", "Deadline": "2021-03-27", "Notice": "2021-04-30", "Begin": "2021-11-10", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Verona, Italy", "Categories": null, "CallForPapers": " European Wireless (EW) is a key venue for European and worldwide researchers to be acquainted with the latest trends in wireless communications and networking. The 26th edition of EW (EW 2020) will be held in Verona, Italy, in May 5-7, 2021. The main theme of EW 2020 is “Virtualization paradigms and satellite integration in future generation wireless communications”.    Topics of interest include, but are not limited to, the following:    Radio Access Network and Backhaul/Fronthaul        Design of mmWave radio access for 5G and beyond      Low-cost radio, full-duplex, scalable, sustainable, low-complexity access systems      Mobile base stations based on UAVs and drones for 5GB      Optimization and resource allocation      Channel modeling and propagation      Modulation & coding      Interference management, localization and positioning      Error-correcting codes for 5G and beyond      Internet of Things      Virtualization of radio access network      Slicing of wireless virtual resources      Cloud radio access network      Fundamental limits, information theory for wireless      Wired-wireless integration      Ultra-Wideband Communications      Optical wireless and visible light communications      Energy efficient and Green communications      Emerging concepts: machine learning, big data analytics and information processing, programmable surfaces for wireless transmissions, molecular communications      Testbeds for future generation radio access networks      Mobility management and billing technologies    Edge and Core Network        Protocols and architectures, and resource allocation      Metrics for quality-of-service (QoS) and quality-of-experience (QoE)      Network coding      Mobile Edge Cloud      Distributed computing and distributed storage      SDN-NFV and virtual network resource slicing      Distributed caching, multi-tenancy, cloud computing and edge computing      Machine learning for edge and core future generations networks. Autonomic networks      Application layer: Mobile apps and platforms, emerging applications in wireless networks      Quantum communications, protocols and quantum Internet    Satellite-5G integration        AI and Machine Learning for SatCom      Coding, modulation and synchronization      Multiple Access techniques      MIMO, multi-user detection & diversity techniques      Fading and interference mitigation techniques      Network slicing      Radio Resource Management      Smart on-board processing techniques      MEC schemes for integrated 5G-satellite networks      SDN/NFV for integrated 5G-satellite networks      Very/Ultra High Throughput Satellites      Optical feeder links      Massive M2M/IoT over satellite      Swarm of nano and pico satellites technologies      Mega Constellations      NTN Standardisation within 3GPP      Satellite demonstrations and trials      Big Data over Satellite    5G and Beyond Verticals and Services        Tactile internet, ultra-low latency communications, ultra-reliable communications      Internet of Things, machine-type communications      Smart cities      Vehicular communications      Industry views on future wireless networks      Regional visions and requirements for future networks    Wireless Security        Security and Privacy      Physical-Layer Security for 5G and Beyond      Cyber-Physical Systems      Secure solutions for SDN and NFV    In addition, you can submit a paper to the EW2020 Special Sessions HERE!    EW 2020 is committed to the highest publication and ethical standards through a rigorous single-blind peer-review process. Submitted manuscripts must be original and not be published or under review elsewhere. Papers must not infringe any copyright or third party right. The proceedings of EW 2020 will be published and will be made available on IEEE Xplore.  Last updated by Dou Sun in 2021-02-28 "}, {"Conference": "JSE 2021: International Conference on Software Engineering and Applications", "Link": "https://cst2021.org/jse/index", "Deadline": "2021-03-27", "Notice": "2021-05-20", "Begin": "2021-12-23", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Sydney, Australia", "Categories": null, "CallForPapers": " 10th International Conference on Software Engineering and Applications (JSE 2021)    December 23 ~ 24, 2021, Sydney, Australia    https://cst2021.org/jse/index    Scope & Topics    10th International Conference on Software Engineering and Applications (JSE 2021) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications of Software Engineering and Applications. The goal of this Conference is to bring together researchers and practitioners from academia and industry to focus on understanding Modern software engineering concepts and establishing new collaborations in these areas.    Authors are solicited to contribute to the Conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of software engineering & applications.    Topics of interest include, but are not limited to, the following       • The Software Process  • Software Engineering Practice  • Web Engineering  • Quality Management  • Managing Software Projects  • Advanced Topics in Software Engineering  • Multimedia and Visual Software Engineering  • Software Maintenance and Testing  • Languages and Formal Methods  • Web-based Education Systems and Learning Applications  • Software Engineering Decision Making  • Knowledge-based Systems and Formal Methods     Paper Submission    Authors are invited to submit papers through the conference Submission System by March 27, 2021. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed).    Selected papers from JSE 2021, after further revisions, will be published in the special issue of the following journal.    • International Journal of Software Engineering & Applications (IJSEA) - ERA Indexed  • Computer Science & Engineering: An International Journal (CSEIJ)  • Advanced Computing: An International Journal (ACIJ)  • International Journal of Information Sciences and Techniques (IJIST)  • International Journal of Computer Science, Engineering and Information Technology (IJCSEIT)  • International Journal in Foundations of Computer Science & Technology (IJFCST)  • International Journal of Information Technology, Control and Automation (IJITCA)    Important Dates    • Submission Deadline : March 27, 2021  • Authors Notification : May 20, 2021  • Registration & Camera-Ready Paper Due : June 02, 2021    Contact Us    Here's where you can reach us: jse@cst2021.org or jseconf@yahoo.com    Submission System    https://cst2021.org/submission/index.php    Last updated by Richert Kevin in 2021-03-16 "}, {"Conference": "NLP 2021: International Conference on Natural Language Processing", "Link": "https://cst2021.org/nlp/index", "Deadline": "2021-03-27", "Notice": "2021-05-20", "Begin": "2021-12-23", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Sydney, Australia", "Categories": null, "CallForPapers": " 10th International Conference on Natural Language Processing (NLP 2021)    December 23 ~ 24, 2021, Sydney, Australia    https://cst2021.org/nlp/index    Scope & Topics    10th International Conference on Natural Language Processing (NLP 2021) is a programmed approach to analyze text that is based on both a set of theories and a set of technologies. This forum aims to bring together researchers who have designed and build software that will analyze, understand, and generate languages that humans use naturally to address computers.    Authors are solicited to contribute to the Conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of Natural Language Processing.    Topics of interest include, but are not limited to, the following       • Algorithms and Data Structures  • Phonology, Morphology  • Chunking/Shallow Parsing  • Parsing/Grammatical Formalisms  • Semantic Processing  • Lexical Semantics  • Ontology  • Linguistic Resources  • Statistical and Knowledge based methods  • POS tagging  • Discourse  • Paraphrasing/Entailment/Generation  • Machine Translation  • Information Retrieval  • Text Mining  • Information Extraction  • Question Answering  • Dialog Systems  • Spoken Language Processing  • Speech Recognition and Synthesis    Paper Submission    Authors are invited to submit papers through the conference Submission System by March 27, 2021. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed).    Selected papers from NLP 2021, after further revisions, will be published in the special issue of the following journal.    • International Journal on Computational Science & Applications (IJCSA)  • International Journal on Natural Language Computing (IJNLC)  • International Journal of Web & Semantic Technology (IJWesT)    Important Dates    • Submission Deadline : March 27, 2021  • Authors Notification : May 20, 2021  • Registration & Camera-Ready Paper Due : June 02, 2021    Contact Us    Here's where you can reach us: nlp@cst2021.org or nlp.conf@yahoo.com  Submission System    https://cst2021.org/submission/index.php    Last updated by Richert Kevin in 2021-03-16 "}, {"Conference": "VLSIE 2021: International Conference on VLSI & Embedded Systems", "Link": "https://cst2021.org/vlsie/index", "Deadline": "2021-03-27", "Notice": "2021-05-20", "Begin": "2021-12-23", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Sydney, Australia", "Categories": null, "CallForPapers": " 2nd International Conference on VLSI & Embedded Systems (VLSIE 2021)    December 23 ~ 24, 2021, Sydney, Australia    https://cst2021.org/vlsie/index  Scope & Topics    2nd International Conference on VLSI & Embedded Systems (VLSIE 2021) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications of VLSI and Embedded Systems. Original, unpublished papers, describing research in the general area of VLSI and Embedded Systems are solicited. Both theoretical and experimental research results are welcome in the following areas, but are not limited to.  Authors are solicited to contribute to the Conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of Computer Science & Technology.    Topics of interest include, but are not limited to, the following       VLSI    • VLSI Design  • VLSI Circuits  • Computer-Aided Design (CAD)  • Low Power and Power Aware Design  • Testing, Reliability, Fault-Tolerance  • Emerging Technologies  • Post-CMOS VLSI  • VLSI Applications (Communications, Video, Security, Sensor Networks, etc)  • Microarchitecture Design  • Digital Integrated Circuits and Systems  • Biomedical Circuits and Healthcare Systems  • Electronic Design Automation  • Security and Privacy  • Emerging Technologies and new age Nano electronics  • Analog and Mixed-Signal Design/RF Circuit Design  Embedded Systems    • Application-specific processors and devices  • Business Applications  • Component and binding models  • Embedded computing education  • Embedded hardware support  • Embedded software  • Embedded system architecture  • Hardware and software co-design  • Industrial practices and benchmark suites  • Integration with business logic  • Integration with SOA  • Middleware  • Networked Embedded Systems  • Policy-based management  • Programming abstractions  • Real-time systems  • Recent Trends  • Service-Oriented architectures  • Testing techniques   • Artificial Intelligence and Machine                         Paper Submission    Authors are invited to submit papers through the conference Submission System by March 27, 2021. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed).    Selected papers from VLSIE 2021, after further revisions, will be published in the special issues of the following journals  • Signal & Image Processing: An International Journal (SIPIJ)  • International Journal of VLSI Design & Communication Systems (VLSICS)  • International Journal of Embedded Systems and Applications (IJESA)  • Information Technology in Industry ITII)New – ESCI(WOS)Indexed    Important Dates    • Submission Deadline: March 27,2021  • Notification: May 20,2021  • Final Manuscript Due: June 02, 2021    Contact Us    Here's where you can reach us :vlsie@cst2021.org or vlsieconf@yahoo.com     Submission System link: https://cst2021.org/submission/index.php          Last updated by Richert Kevin in 2021-03-15 "}, {"Conference": "NeTIOT 2021: International Conference on Networks & IOT", "Link": "https://cst2021.org/netiot/index", "Deadline": "2021-03-27", "Notice": "2021-05-20", "Begin": "2021-12-23", "End": null, "AbstractRegistrationDue": null, "NotificationDue": null, "FinalVersionDue": null, "Extended": "Extended", "Location": "Sydney, Australia", "Categories": null, "CallForPapers": " 2nd International Conference on Networks & IOT (NeTIOT 2021)    December 23 ~ 24, 2021, Sydney, Australia    https://cst2021.org/netiot/index  Scope & Topics    2nd International Conference on Networks & IOT (NeTIOT 2021) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications of Computer Networks & IOT. The aim of the conference is to provide a platform to the researchers and practitioners from both academia as well as industry to meet and share cutting-edge development in the field.  Authors are solicited to contribute to the Conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of Computer Science & Technology.    Topics of interest include, but are not limited to, the following      • Deep Learning  • Learning in knowledge-intensive systems  • Addressing and Location Management  • Broadband Access Technologies  • Adhoc and Sensor Networks  • Cross Layer Design and Optimization  • Heterogeneous Wireless Networks  • High Speed Networks  • Internet and Web Applications  • Measurement & Performance Analysis  • Mobile & Broadband Wireless Internet  • Mobile Networks & Wireless LAN  • Network Architectures  • Network Based Applications  • Network Protocols & Wireless Networks  • Network Operations & Management  • Network Security Trust, & Privacy  • Next Generation Internet & Web Architectures  • Peer to Peer and Overlay Networks  • QOS And Resource Management  • Recent Trends & Developments in Computer Networks  • Routing, Switching and Addressing Techniques  • Self-Organizing Networks and Networked Systems  • Ubiquitous Networks  • Virtual & Overlay Networks  • Wireless & Mobile Networks  • Wireless Communications  • Wireless Mesh Networks and Protocols  • Wireless Multimedia Systems  • Network and Communications Security  • Graph Theory in Wireless Ad hoc Networks and Sensor Networks  • Security and Privacy for IoT  • IoT-enabled Innovation and Entrepreneurship  • IoT Applications and Services  • Experimental Results and Deployment Scenarios  • Electronics and Signal processing for IoT  • Connectivity and Networking    Paper Submission    Authors are invited to submit papers through the conference Submission System by March 27, 2021. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed).    Selected papers from NeTIOT 2021, after further revisions, will be published in the special issues of the following journals  • International Journal of Computer Networks & Communication (IJCNC) – Scopus Indexed, ERA Indexed  • International Journal of Network Security & Its Applications (IJNSA)- ERA Indexed  • International Journal of Wireless & Mobile Networks (IJWMN)- ERA Indexed  • International Journal of Next-Generation Networks (IJNGN)  • International Journal of Ubiquitous Computing (IJU)  • International Journal on Applications of Graph Theory in Wireless Ad hoc Networks and Sensor Networks (GRAPH-HOC)    Important Dates    • Submission Deadline: March 27,2021  • Notification: May 20,2021  • Final Manuscript Due: June 02, 2021    Contact Us    Here's where you can reach us :netiot@cst2021.org or netiotconf@yahoo.com       Submission System link: https://cst2021.org/submission/index.php          Last updated by Richert Kevin in 2021-03-15 "}, {"Conference": "GHTC  2021 : 2021 IEEE Global Humanitarian Technology Conference", "Link": "https://ieeeghtc.org/", "Deadline": "2021-05-01", "Notice": null, "Begin": "2021-10-19", "End": "2021-10-23", "AbstractRegistrationDue": null, "NotificationDue": "2021-06-14", "FinalVersionDue": "N/A", "Extended": null, "Location": "virtual (Seattle)", "Categories": "technology   humanitarian   UN SDG   enginerring", "CallForPapers": "The 2021 11th IEEE Global Humanitarian Technology Conference (IEEE GHTC 2021) is a flagship international conference sharing practical technology-enabled solutions supporting achievement of the United Nations Sustainable Development Goals (UN SDGs) by addressing the needs of underserved communities in resource constrained environments around the world.  Stakeholders from the public, private, education and research, societal, funding and donor sectors are invited to submit Oral Presentation proposals or Short Papers (early-stage results) as well as Full Papers (mature results), sharing Sustainable Development, ICT4D and Humanitarian Technology related insights, experiences, good practices and lessons learnt from a research, policy, practitioner and/or community perspective.  Papers should present analysis of initial or final research results or a case study. General project descriptions are not appropriate. Submissions will be assessed for quality, relevance, consideration of ethical issues, methodological vigor and potential or actual impact.  Submissions by community representatives, practitioners (governmental, for-profit and nonprofit), academics, private sector organizations and policy makers describing intervention design and implementation, field experiences and best practices, case studies, project monitoring and evaluation results, and original research are of particular interest. Paper submissions should include results that have not previously been published and have not been submitted to another conference or journal.  Please note that all submissions will undergo a Plagiarism Check before being assigned for blind peer review by members of the IEEE GHTC 2021 International Technical Programme Committee (TPC), who are all experienced subject matter experts.  IEEE GHTC 2021 Thematic areas include (but are not limited to): ● Good Health and Well Being (SDG3) ● Affordable and Clean Energy (SDG7) ● Communication/Connectivity in Support of Development ● Disaster Mitigation, Preparedness, Response and Recovery ● Sustainable Cities and Communities (SDG11) ● Quality Education (SDG4) ● Clean Water and Sanitation (SDG6) ● Decent Work and Economic Growth (SDG8) ● Agriculture and Food Security (SDG2) ● Technology Impacts on Societal Evolution   For complete details on topics and submission see https://bit.ly/3eJFEcn  As well as describing ethical and sustainability challenges and technological aspects, submissions are encouraged to consider socio-cultural, socio-economic, environmental and policy perspectives, and explain how Sustainable Development related good practices such as skills capacity building, community ownership, Co-design, Collaborative Open Innovation, and Theory of Change are applied.  Three types of submissions are invited for presentation at GHTC: ** Full Papers: mature results or completed projects and should not exceed eight pages. ** Short Papers: interim results, experiences and perspectives, and should be three to four pages in length including a short reference section.  ** Oral-Only: work-in-progress; projects at an early stage of implementation; option for community representatives, practitioners or policy makers who prefer not to write a paper. Oral-Only submissions should be described in one or two pages.   NOTE: we are accepting proposals for multi-stakeholder Special Sessions (up to 8 pages)  Accepted Full Papers, Short Papers and Oral-Only Presentations will be grouped thematically to facilitate focused discussion, community building and networking based on common interests.   Selected accepted Full Papers will be invited to submit a revised, extended version to an IEEE journal."}, {"Conference": "CISETC  2021 : Congress on Education and Technology in Sciences", "Link": "http://www.usat.edu.pe/cisetc2021/works.php", "Deadline": "2021-08-31", "Notice": null, "Begin": "2021-03-15", "End": "2021-08-31", "AbstractRegistrationDue": null, "NotificationDue": "2021-10-15", "FinalVersionDue": "N/A", "Extended": null, "Location": "Chiclayo, Perú", "Categories": "science   technology   engineering   math", "CallForPapers": "¡Call for papers! International Congress on Education and Technology in Sciences  Submit your paper at the Second International Congress on Education and Technology in Sciences in Chiclayo - Peru. Accepted and presented articles will be considered for publication in Scopus and Web of Science."}, {"Conference": "IFIP-ICEC  2021 : The 20th IFIP International Conference on Entertainment Computing", "Link": "https://www.ifip-icec.org", "Deadline": "2021-06-07", "Notice": null, "Begin": "2021-11-02", "End": "2021-11-05", "AbstractRegistrationDue": null, "NotificationDue": "2021-07-02", "FinalVersionDue": "N/A", "Extended": null, "Location": "Coimbra, Portugal", "Categories": "entertainment computing   entertainment   HCI   games", "CallForPapers": "The 20th IFIP INTERNATIONAL CONFERENCE ON ENTERTAINMENT COMPUTING (IFIP-ICEC 2021)  Date: November 2 - 5, 2021 Location: Coimbra, Portugal Website: www.ifip-icec.org  Call for Papers: The 20th International Federation for Information Processing - International Conference on Entertainment Computing (IFIP-ICEC 2020) will be held in Coimbra, Portugal, on Nov. 2-5, 2020: The conference is organized by the the IFIP-ICEC TC14 - Entertainment Computing Technical Committee, and will be hosted by the University of Coimbra (Portugal), in association with the Portuguese Society for the Sciences of Videogames. IFIP-ICEC is the longest lasting and prime scientific conference series in the area of Entertainment Computing. It brings together practitioners, researchers, artists, designers, and industry on the design, creation, development, use, application and evaluation of digital entertainment content and experience systems. In addition, it brings together research on education and entertainment. This event covers a diverse array of related research issues, including game-based learning and other learning experiences associated with entertainment.  COVID-19 Information    We are fully aware that the situation regarding Covid-19 is a cause for concern. Hopefully, vaccination and traveling measures will have been adopted and the situation being normalised after the summer and therefore will hardly affect our conference schedule. Nevertheless, for those not being able to travel, we have measures to facilitate remote participation. It is our plan to bring all conference rooms online, enabling both local and distance engagement.  All accepted papers will be indexed by EI, and be published in book form in the Springer Lecture Notes in Computer Science (LNCS) series. In addition, selected best papers from the conference will be invited for submission of an extended version to a special issue of Entertainment Computing (published by Elsevier).  In addition, this edition will feature a special track where authors of selected recent papers from the Journal of Entertainment Computing (Elsevier), will be invited to present their work at the conference.   Aims    IFIP TC14 aims to encourage research, development and sharing of innovative ideas, models and practices, on computer applications in entertainment. To enhance computation and use studies in this field, the technical program committee invites original submissions.    Topics can include but are not limited to:  *Design and Analysis* Game Design: Theory, Creation & Testing    Interactive Narratives & Digital Storytelling Entertainment Robots, Toys & Smart Gadgets Social Media / Social Computing Entertainments New Genres of Interactive & Digital Entertainment Interactive Art, Performance and Novel Interactions  *Digital Art & Installations* Virtual/Augmented/Mixed Reality & Entertainment Ubiquitous/Pervasive Entertainment Sound, Music & Performance TransMedia and Entertainment Entertainment Devices, Platforms & Systems  *Digital Entertainment Hardware & Devices* Entertainment for Nomadic Users Ambient Entertainment Digital Broadcasting and Digital Cinema Interactive Television and Broadcasting Theoretical Foundations and Ethical Issues  *Experiential Aspects in Entertainment* Emotions and Affective Interaction Theoretical Basis of Entertainment Social / Cultural Impacts of Digital Entertainment Issues of Public Relations & Advertising Through Entertainment Entertainment for Purpose & Persuasion  *Serious Games* Games for Learning, Health & Well-Being Games For Change & Social Impact Games Exergaming Advergames and Digital Marketing  *Computational Methodologies for Entertainment* Artificial Intelligence & Machine Learning for Entertainment Procedural Content Generation Computer Graphics & Visual Effects Big Data in Entertainment Security & Privacy in Entertainment  *Algorithmic research on board and card games* New types of entertainment using information technologies Hardware technology research and development to implement entertainment systems Non-traditional human interface technologies for entertainment  We invite submissions under the following categories (deadlines): Full Research Papers  Works-in-Progress Interactive Entertainment / Experiential works  Tutorials proposals Workshop proposals Submissions to Student Competition  Please check our website www.ifip-icec.org for updates and more information."}, {"Conference": "IJCAI-ASEA  2021 : The IJCAI-21 Workshop on Applied Semantics Extraction and Analytics", "Link": "https://asea2021.github.io/ijcai-asea2021/", "Deadline": "2021-04-24", "Notice": null, "Begin": "2021-08-21", "End": "2021-08-23", "AbstractRegistrationDue": null, "NotificationDue": "N/A", "FinalVersionDue": "N/A", "Extended": null, "Location": "Virtual", "Categories": "artificial intelligence   data mining   semantics   data analytics", "CallForPapers": "The IJCAI-21 Workshop on Applied Semantics Extraction and Analytics (ASEA) Virtual/Online Conference  https://asea2021.github.io/ijcai-asea2021/ Part of IJCAI-2021 (https://ijcai-21.org/)  ## ABOUT ASEA## This one-day virtual workshop’s objective is to bring together researchers working on various streams related to semantics to study and develop the broader research area of semantics extraction and analytics and their applications. The program of the workshop will include invited talks, spotlight paper presentations, and lightning poster presentations to showcase research opportunities, novel solutions and systems, success stories, and future directions.  ## IMPORTANT DATES## Paper Submission Deadline Apr 24, 2021 Notification of Acceptance May 24, 2021 Workshop          Aug 21-23, 2021  ## CALL FOR PAPERS ## We invite submissions of original contributions on methods, applications, and systems on artificial intelligence and machine learning for semantics extraction and analytics. The scope of the workshop includes, but is not limited to, the following areas: - Workflows, methodologies, and frameworks for semantics extractions - Knowledge representation for semantics - Extract data-specific semantics (e.g., text, image, video, etc.) - Extract Semantics from multi-modal data - Fusion of semantics from multiple data sets - Applied Semantics – how extracted semantics enable AI systems to perform? - Semantics and Explainability - Semantics representations and specifications - Semantics and Data Description - Semantics from large-scale data sources such as Wikipedia, Web, and Social Networked data - Applications in Finance, Legal, Sports, News, research publications, etc.  ## SUBMISSIONS ## Double-blinded peer-review, long (6+1 pages) or short (4+1 pages) to EasyChair https://easychair.org/conferences/?conf=asea2021  ## ORGANIZERS ## - Prof. Kamalakar Karlapalem, IIIT Hyderabad - Prof. Craig Knoblock, University of Southern California - Prof. Mausam, IIT Delhi - Dr. Sameena Shah, J.P. Morgan AI Research  ## CONTACT ## Website: https://asea2021.github.io/ijcai-asea2021/ Email: asea2021@easychair.org"}, {"Conference": "COSE  2021 : First International Workshop on COllaborative SEnsing in the Web of Things", "Link": "http://swot.sisinflab.poliba.it/cose2021/", "Deadline": "2021-04-17", "Notice": null, "Begin": "2021-08-09", "End": "2021-08-12", "AbstractRegistrationDue": null, "NotificationDue": "2021-05-17", "FinalVersionDue": "N/A", "Extended": null, "Location": "Leuven, Belgium", "Categories": "internet of things   semantic web   pervasive computing   mobile systems", "CallForPapers": "*COSE 2021 - the First International Workshop on COllaborative SEnsing in the Web of Things* in conjunction with the 18th International Conference on Mobile Systems and Pervasive Computing, August 9-12, 2021, Leuven, Belgium.  http://swot.sisinflab.poliba.it/cose2021/  *Important Dates:* - Paper Submission: April 17, 2021 - Author Notification: May 17, 2021 - Final Manuscript: June 15, 2021  *About* Collaborative sensing paradigms such as sensing as a service are recently emerging. They are characterized by mobile agents able to offer, request, discover and exploit data sensing and analysis services, enabled by embedded sensors or devices in their close proximity, connected through low-power wireless protocols. This model is typically:  - peer-to-peer: any node can request data or search for specific kinds of sensors and devices; - opportunistic: designed to exploit dynamically the available resources in a certain area in a given time window; - participatory: user agents are invited to contribute their data, sensing and computing resources to the network.  Collaborative sensing approaches should be general enough to support various types of applications, platforms and devices. Furthermore, effective incentive mechanisms should be introduced to promote a sustained collaboration. As interoperability issues involve both application-layer network protocols and data exchange formats, integrating World Wide Web - and particularly Semantic Web – technologies is a relevant research trend for promoting collaboration in large-scale data sensing and processing scenarios, such as multi-party deployments and federations.  *Submission Guidelines*  Paper must be submitted via EasyChair: https://easychair.org/conferences/submission_new?a=26151658  All papers must be original and not simultaneously submitted to another journal or conference. The total length for each paper is limited to 6 pages. Two extra pages can be added. But, for each extra page, a fee of €65 will be charged. The maximum number of pages (including extra pages) is strictly limited to 8 pages. The submitted paper must be formatted according to the guidelines of Procedia Computer Science.  *List of Topics*  The Workshop is dedicated to frameworks, architectures, technologies and systems for collaborative sensing, with particular emphasis on ubiquitous/pervasive computing and on (Semantic) Web of Things technology stacks. Topics include, but are not limited to:  - collaborative and participatory sensing in WSN, IoT and WoT scenarios; - collaborative, decentralized and peer-to-peer protocols for device and sensor discovery; - collaborative, decentralized and peer-to-peer protocols and frameworks for data discovery, data mining and machine learning; - sensing-as-a-service frameworks, architectures and protocols; - opportunistic sensing and computing in ubiquitous contexts; - design and evaluation of incentive mechanisms for participatory sensing; - energy-conscious and resource-conscious collaborative sensing; - user-centered personalized participatory sensing tools, interfaces and applications; - Semantic Web technologies for collaborative sensing and ubiquitous sensor networks; - distributed ledger and blockchain technologies for collaborative sensing.  *Program Committee*  - Eugenio Di Sciascio, Polytechnic University of Bari, Italy - Hasan Ali Khatthak, National University of Sciences & Technology, Islamabad, Pakistan - Thilanka Munasinghe, Rensselaer Polytechnic Institute, Troy, NY, USA - Andrea Omicini, University of Bologna Alma Mater Studiorum, Bologna, Italy - Evan Patton, Massachusetts Institute of Technology, Boston, USA - Oshani Seneviratne, Rensselaer Polytechnic Institute, Troy, NY, USA - Quan Z. Sheng, Macquarie University, Australia - William Van Woensel, Dalhousie University, Halifax, Canada - Sherali Zeadally, University of Kentucky, Lexington, KY USA  The list will be constantly updated on the workshop website.  *Organizing committee*  - Giuseppe Loseto - Polytechnic University of Bari, Italy - Floriano Scioscia - Polytechnic University of Bari, Italy - Michele Ruta - Polytechnic University of Bari, Italy  *Publication*  COSE 2021 proceedings will be published in Procedia Computer Science.  Extended versions of selected papers presented at the workshop will be considered for publication in a special issue of Sensors, MDPI, at a discounted publishing fee. At least 50% new material will be required for the journal paper.  *Venue*  The workshop will be held in Leuven, Belgium, in conjunction with The 18th International Conference on Mobile Systems and Pervasive Computing, August 9-12, 2021.  *Contact*  All questions should be emailed to: Giuseppe Loseto - giuseppe.loseto@poliba.it  Best regards, COSE 2021 Organizers Giuseppe Loseto, Floriano Scioscia, Michele Ruta"}, {"Conference": "DARCH  2021 : 1st International Conference on Architecture and Design", "Link": "https://www.ocerints.org/darch21/", "Deadline": "2021-06-25", "Notice": null, "Begin": "2021-07-12", "End": "2021-07-13", "AbstractRegistrationDue": null, "NotificationDue": "2021-06-25", "FinalVersionDue": "2021-06-25", "Extended": null, "Location": "İstanbul", "Categories": "architecture   engineering   design   sustainability", "CallForPapers": "DARCH 2021- 1st International Conference on Architecture and Design Virtual/ Online Conference International Organization Center of Academic Research https://www.ocerints.org/darch21   CALL FOR PAPERS: You are invited to participate in DARCH 2021 1st International Conference on Architecture and Design that will be held in a fully virtual (online) format, on 12-13 July 2021.  SUBMIT YOUR ABSTRACT ONLINE NOW: https://www.ocerints.org/darch21/index.php/abstract-submission   CONFERENCE TOPICS: include, but are not limited to: all areas of Architecture and Design; interior architecture, landscape architecture, etc.  WHY SHOULD YOU ATTEND? AN INTERNATIONAL EVENT: You will be able to share all your experiences with other experts in a truly international atmosphere. This conference will be held at the international level. Plenty of participants from more than 30 different countries all over the world are expected to attend.  IMPORTANT DATES FOR PAPERS: - Abstract Submission Deadline: June 21, 2021 - Final Paper Submission Deadline: June 25, 2021 - Registration deadline for authors: June 25, 2021 - Conference Dates: July 12-13, 2021  PUBLICATION OPPORTUNITIES: 1. All the accepted full papers will be published in the Abstracts & Proceedings CD-ROM (e-book) with an ISBN number and will be given to the participants during the conference. 2.) A DOI number will be assigned to each published paper in the conference e-proceedings. 3. Participants will also be able to access and download the Abstracts & Proceedings E-book from OCERINT's online e-library (http://www.ocerints.org/index.php/digital-library ) web site. 4. DARCH 2021 Abstracts & Proceedings will also be included in Google Scholar and sent to be reviewed for their inclusion in the ISI Conference Proceedings Citation Index. We look forward to your participation.  Sincerely,  DARCH 2021 Organizing Committee Conference Website: https://www.ocerints.org/darch21  Inquiries: darch21conference@gmail.com  Or intoffice@ocerint.org"}, {"Conference": "HOPE  2021 : ACM SIGPLAN Workshop on Higher-Order Programming with Effects", "Link": "https://icfp21.sigplan.org/home/hope-2021", "Deadline": "2021-05-06", "Notice": null, "Begin": "2021-08-22", "End": "2021-08-22", "AbstractRegistrationDue": null, "NotificationDue": "N/A", "FinalVersionDue": "N/A", "Extended": null, "Location": "online", "Categories": "PL   programming language   design, implementation, theory", "CallForPapers": "HOPE is an established informal workshop bringing together researchers interested in the design, semantics, implementation, and verification of higher-order effectful programs. Talks about work in progress are particularly encouraged.  It has been held since 2012 in affiliation with ICFP.  We solicit proposals for contributed talks, in plain text or PDF format. The motivation, the problem to solve, accomplished and anticipated results should be clear from two first pages of the submission. By default contributed talks are about 30 minutes long; proposals for shorter or longer talks will also be considered. Speakers may also submit supplementary material (e.g. a full paper, talk slides), which PC members are free (but not expected) to read. If you have any questions about the relevance of a particular topic, please contact the PC chairs, Oleg Kiselyov (oleg@okmij.org) and Ohad Kammar (ohad.kammar@ed.ac.uk).   Program Committee  Anton Bachin               USA Eli Bingham                Broad Institute, USA Liron Cohen                Ben Gurion Univeristy, Israel Ohad Kammar   (co-chair)   University of Edinburgh, Scotland, UK Jeehoon Kang               KAIST, South Korea Oleg Kiselyov (co-chair)   Tohoku University, Japan Andreas Rossberg           DFinity Foundation, Germany Kathrin Stark              Princeton University, New Jersey, USA Simon Thompson             University of Kent / IOHK, England, UK"}, {"Conference": "AMTE  2021 :  Asynchronous Many-Task systems for Exascale 2021", "Link": "https://amte2021.stellar-group.org/", "Deadline": "2021-05-18", "Notice": null, "Begin": "2021-08-30", "End": "2021-08-31", "AbstractRegistrationDue": null, "NotificationDue": "2021-07-17", "FinalVersionDue": "N/A", "Extended": null, "Location": "Virtual", "Categories": "HPC   AMT   exascale", "CallForPapers": "Background  The next generation of supercomputers will break the exascale barrier, and tremendous amounts of work have been invested into identifying and overcoming the challenges of the exascale era. These challenges include load-balancing, fast data transfers, and efficient resource utilization. Task-based models and runtime systems have shown that it is possible to address these challenges by providing additional mechanisms such as oversubscription, task/data locality, shared memory, and data dependence driven execution.  This workshop explores the advantages of task-based programming on modern and future HPC systems. It will gather developers, users, and proponents of these models and systems to share experience, discuss how they meet the challenges posed by Exascale system architectures, and explore opportunities for increased performance, robustness, and full-system utilization. Topics  The workshop will focus on the following areas:  - Novel task-based runtime environments - Experiences of using task-based runtime environments for large applications - Experiences comparing task-based runtime environments - Experiences gathered from porting one large-scale parallel solution to another, e.g., MPI to Charm++, etc. - Profiling and performance monitoring of task-based environments - Benchmarks for task-based runtimes - Tools for debugging programs using task-based runtimes - Challenges to task-based runtimes in scaling to large clusters - Hardware challenges and solutions in using task-based environments"}, {"Conference": "AC  2021 : 18th International Conference Applied Computing 2021", "Link": "https://www.computing-conf.org/", "Deadline": "2021-05-03", "Notice": null, "Begin": "2021-10-13", "End": "2021-10-15", "AbstractRegistrationDue": null, "NotificationDue": "2021-06-04", "FinalVersionDue": "N/A", "Extended": null, "Location": "online", "Categories": "computer science   IOT   algorithms   intelligent systems", "CallForPapers": "-- CALL FOR PAPERS AC 2021 - Deadline for submissions: 3 May 2021 --  18th International Conference Applied Computing 2021 October 13 – 15 2021, Virtual (http://www.computing-conf.org/)  * Conference Scope The Applied Computing 2021 conference aims to address the main issues of concern within the applied computing area and related fields. This conference covers essentially technical aspects. The conference is divided into more detailed areas, for more information please check http://www.computing-conf.org/call-for-papers   * Paper Submission This is a blind peer-reviewed conference. Authors are invited to submit their papers in English through the conference submission system by May 3, 2021. Submissions must be original and should not have been published previously.   * Important Dates: - Submission Deadline: 3 May 2021 - Notification to Authors: 4 June 2021 - Final Camera-Ready Submission and Early Registration: Until 28 June 2021 - Late Registration: After 28 June 2021  * Paper Publication The papers will be published in book and electronic format with ISBN, will be made available through the Digital Library available at http://www.iadisportal.org/digital-library/showsearch.  The best paper authors will be invited to publish extended versions of their papers in specific journals, and in the IADIS International Journal on Computer Science and Information Systems.  The conference proceedings will be submitted for indexation (pending approval) by IET’s INSPEC, Elsevier, EI Compendex, Scopus, Thomson Reuters Web of Science, EBSCO and other important indexing services.  * Conference Contact: E-mail: secretariat@computing-conf.org  Web site: http://www.computing-conf.org/  * Organized by: International Association for Development of the Information Society"}, {"Conference": "ICWI  2021 : 20th International Conference WWW/Internet 2021", "Link": "https://www.internet-conf.org/", "Deadline": "2021-05-03", "Notice": null, "Begin": "2021-10-13", "End": "2021-10-15", "AbstractRegistrationDue": null, "NotificationDue": "2021-06-04", "FinalVersionDue": "N/A", "Extended": null, "Location": "online", "Categories": "computer science   semantic web and xml   web development   web 2.0", "CallForPapers": "--CALL FOR PAPERS ICWI - Deadline for submissions: 3 May 2021 --  20th International Conference WWW/Internet 2021 October 13 – 15 2021, Virtual  (http://www.internet-conf.org/)  * Conference Scope The WWW/Internet 2021 conference aims to address the main issues of concern within WWW/Internet. WWW and Internet had a huge development in recent years. Aspects of concern are no longer just technical anymore but other aspects have aroused.  This conference aims to cover both technological as well as non-technological issues related to these developments.  The conference accepts submissions in the following five main areas: Web 2.0; Semantic Web and XML; Applications and Uses; Services, Architectures and Web Development; Research Issues. For more details please check http://www.internet-conf.org/call-for-papers   * Paper Submission This is a blind peer-reviewed conference. Authors are invited to submit their papers in English through the conference submission system by May 3, 2021. Submissions must be original and should not have been published previously.   * Important Dates: - Submission Deadline: 3 May 2021 - Notification to Authors: 4 June 2021 - Final Camera-Ready Submission and Early Registration: Until 28 June 2021 - Late Registration: After 28 June 2021  * Paper Publication The papers will be published in book and electronic format with ISBN, will be made available through the Digital Library available at http://www.iadisportal.org/digital-library/showsearch.  The best paper authors will be invited to publish extended versions of their papers in a special issue published in the IADIS International Journal on WWW/Internet (ISSN: 1645-7641) and in other selected Journals. The conference proceedings will be submitted for indexation (pending approval) by IET’s INSPEC, Elsevier, EI Compendex, Scopus, Thomson Reuters Web of Science, EBSCO and other important indexing services.  * Conference Contact: E-mail: secretariat@internet-conf.org Web site: http://www.internet-conf.org/  * Organized by: International Association for Development of the Information Society"}, {"Conference": "CELDA  2021 : 18th International Conference on Cognition and Exploratory Learning in Digital Age 2021", "Link": "https://www.celda-conf.org/", "Deadline": "2021-05-03", "Notice": null, "Begin": "2021-10-13", "End": "2021-10-15", "AbstractRegistrationDue": null, "NotificationDue": "2021-06-04", "FinalVersionDue": "N/A", "Extended": null, "Location": "online", "Categories": "e-learning    education   learning technologies   computer science", "CallForPapers": "CALL FOR PAPERS CELDA 2021 - Deadline for submissions: 3 May 2021  18th International Conference on Cognition and Exploratory Learning in Digital Age (CELDA 2021) October 13 – 15 2021, Virtual (http://www.celda-conf.org/)  * Important: Due to the coronavirus (COVID-19) pandemic, this conference will be held online via Zoom.  * Conference Scope The CELDA 2021 conference aims to address the main issues concerned with evolving learning processes and supporting pedagogies and applications in the digital age. There have been advances in both cognitive psychology and computing that have affected the educational arena. The convergence of these two disciplines is increasing at a fast pace and affecting academia and professional practice in many ways. Paradigms such as just-in-time learning, constructivism, student-centered learning and collaborative approaches have emerged and are being supported by technological advancements such as simulations, virtual reality and multi-agents systems. These developments have created both opportunities and areas of serious concerns. This conference aims to cover both technological as well as pedagogical issues related to these developments. Main tracks have been identified please check http://www.celda-conf.org/call-for-papers   * Paper Submission This is a blind peer-reviewed conference. Authors are invited to submit their papers in English through the conference submission system by May 3, 2021. Submissions must be original and should not have been published previously.   * Important Dates: - Submission Deadline: 3 May 2021 - Notification to Authors: 4 June 2021 - Final Camera-Ready Submission and Early Registration: Until 28 June 2021 - Late Registration: After 28 June 2021  * Paper Publication The papers will be published in book and electronic format with ISBN, will be made available through the Digital Library available at http://www.iadisportal.org/digital-library/showsearch.  Authors of the best published papers in the CELDA 2021 proceedings will be invited to publish extended versions of their papers in a book published by Springer. The Conference proceedings will be indexed by ERIC - Education Resources Information Center, EBSCO and Elsevier. The proceedings will also be submitted for indexing (pending approval) by IET’s INSPEC, EI Compendex, Scopus, Thomson Reuters Web of Science and other important indexing services.  * Conference Contact: E-mail: secretariat@celda-conf.org Web site: http://www.celda-conf.org/  * Organized by: International Association for Development of the Information Society"}, {"Conference": "AI4Function  2021 : Second Workshop on Artificial Intelligence for Function, Disability, and Health (AI4Function) @ IJCAI 2021", "Link": "https://ai4function.github.io/2021/", "Deadline": "2021-05-05", "Notice": null, "Begin": "2021-08-21", "End": "2021-08-23", "AbstractRegistrationDue": null, "NotificationDue": "2021-05-25", "FinalVersionDue": "N/A", "Extended": null, "Location": "Online", "Categories": "artificial intelligence   medical informatics   disability and rehabilitation", "CallForPapers": "[Call for Papers] The Second Workshop on Artificial Intelligence for Function, Disability, and Health (AI4Function) @ IJCAI 2021 -----------------------------------------------------------------------  Where: Virtual event (host conference in Montreal, Canada) When: August 21, 22, or 23, 2021  IMPORTANT DATES Submissions due – May 5, 2021 Notification of acceptance – May 25, 2021 Camera-ready versions due – June 11, 2021 Workshop – August 21, 22, or 23, 2021  Website: https://ai4function.github.io/2021  Submission link: https://easychair.org/conferences/?conf=ai4function2021   Contact: ai4function@gmail.com  -----------------------------------------------------------------------  The Second Workshop on Artificial Intelligence for Function, Disability, and Health (AI4Function 2021) invites the submission of abstracts, short and long papers describing research that focuses on applying informatics methods, artificial intelligence (AI) or data mining techniques in the area of whole-person care, disability, and functional status information.  Functional Status Information (FSI) describes physical and mental wellness at the whole-person level (as opposed to the cellular or organ level), and includes information on activity performance, social role participation, and environmental and personal factors that affect well-being and quality of life.  Collecting and analyzing this information is critical to addressing the data needs in caring for aging global populations, and providing effective care for individuals with chronic conditions, multi-morbidity, and disability.  However, FSI has proven difficult to capture systematically within existing paradigms, leaving a space ripe for technological innovation.  AI4Function is a venue for researchers cutting across data science and AI methods to discuss new ways to collect and utilize FSI within healthcare delivery, public health, and social well-being.  The first AI4Function workshop brought together researchers from fields as diverse as natural language processing, in-home sensing, psychometrics, and health policy, and we aim to continue this multidisciplinary exchange in the second iteration of the workshop.  TOPICS Relevant topics for the workshop include, but are not limited to: - Informatics methods applied to FSI, including information extraction, information retrieval, and classification of FSI (e.g. mobility, self-care, mental functioning) - Applications of AI for functional status measurement - Usage of FSI to model health outcomes/resource utilization - Terminologies and ontologies related to functional status - Analysis of FSI data (e.g., language data, wearable measurements) - Combinations of multi-modal data to capture functional status  Data sources of interest include, but are not limited to: - Medical records - Disability and work programs  - Health and human services data - Wearable devices - Social media  Targeted data types include, but are not limited to: - Unstructured (free text) narrative - Structured medical data (e.g., lab reports, range of motion assessments)  - Semi-structured reports (e.g., state welfare visit reports) - Standardized clinical surveys (e.g., PROMIS, AM-PAC, PHQ-9) - Population surveys - Wearable device measurements - Video and audio recordings  SUBMISSION INSTRUCTIONS All submissions to AI4Function should be anonymous using the EasyChair submission site (https://easychair.org/conferences/?conf=ai4function2021). Accepted papers will be published on CEUR-WS.org, and submissions should follow the CEURART style available from: https://ceurws.wordpress.com/2020/03/31/ceurws-publishes-ceurart-paper-style/.  At least one author of each accepted paper/abstract must purchase a registration for and attend the workshop.   We invite three types of submissions: - Long papers must be no longer than eight pages for the main body of the paper (including tables and figures), with unlimited space for references.  Long papers are expected to describe reports of original, unpublished research. - Short papers must be no longer than four pages for the main body of the paper (including tables and figures), with unlimited space for references.  Short papers must describe original, unpublished research, and are appropriate for preliminary results, work in progress, etc. - Abstracts must be less than two pages, including references.  Abstracts are appropriate for presenting previously-published research and work in progress.  Authors are required to submit their papers/abstracts in PDF format. Papers that are longer than the page limit will be rejected without review.   ETHICAL/SOCIETAL IMPACT It is optional, but highly recommended, for authors to include a statement of the potential broader impact of their work, including its ethical aspects and future societal consequences. This statement should be included after the main body of the paper, and does not count towards page limits.  REVIEWING PROCESS All submissions to AI4Function will go through a double-blind reviewing process. Accepted abstracts will be presented in the poster session. Accepted papers will be presented as either a talk or a poster, depending on the reviewers’ recommendations.  Accepted short and long papers will be given an additional page to accommodate responses to reviewer feedback; no author response period will be used. Accepted papers will be published in the workshop proceedings on CEUR-WS.  PREPRINT POLICY The existence of non-anonymous preprints (on arXiv, medRxiv, social media, websites, etc.) will not result in rejection provided that the preprints was submitted at least one month before the abstract submission deadline of AI4Function 2021. Note that the submission to EasyChair must always be anonymized regardless of whether a preprint has been released. Reviewers will be instructed not to actively look for such preprints, but encountering them will not constitute a conflict of interest. Preprints (last update) uploaded no more than one month before the AI4Function 2021 abstract submission deadline will be considered as violating anonymity.  CONFIDENTIALITY POLICY AI4Function will adopt the IJCAI confidentiality policy, where all submissions will be treated in strict confidence until the publication date.   CONFLICT OF INTEREST POLICY All individuals involved in the AI4Function review process must adhere to the IJCAI conflict of interest policy. Details can be found at http://ijcai.org/   ORGANIZING COMMITTEE Denis Newman-Griffis (University of Pittsburgh / National Institutes of Health Clinical Center) Bart Desmet (National Institutes of Health Clinical Center) Ayah Zirikly (Johns Hopkins University / National Institutes of Health Clinical Center) Suzanne Tamang (Stanford University) Hongfang Liu (Mayo Clinic)"}, {"Conference": "IEEE CIBCB  2021 : IEEE CIBCB 2021 : 18th IEEE International Conference on Computational Intelligence in Bioinformatics and Computational Biology", "Link": "http://www.federation.edu.au/cibcb2021", "Deadline": "2021-04-30", "Notice": null, "Begin": "2021-10-13", "End": "2021-10-15", "AbstractRegistrationDue": null, "NotificationDue": "2021-06-15", "FinalVersionDue": "N/A", "Extended": null, "Location": "Melbourne, Australia", "Categories": "bioinformatics   computational biology   computational intelligence   artificial intelligence", "CallForPapers": "This conference will bring together top researchers, practitioners, academics and students from around the globe to discuss the latest advances in the field of Computational Intelligence and its application to real world problems in biology, bioinformatics, computational biology, chemical informatics, bioengineering, and related fields. Computational Intelligence approaches include artificial neural networks, fuzzy logic, evolutionary algorithms, hybrid algorithms, and other emerging techniques. Topics of interest include but are not limited to:  •Gene expression array analysis •Neuromorphic integration of bio- and neuroinformatics •Structure prediction and folding •Molecular sequence alignment and analysis •Metabolic pathway analysis •RNA and protein folding and structure prediction •Analysis and visualization of large biological data sets •Motif detection •Molecular evolution and phylogenetics •Systems and synthetic biology •Health: physical and mental •Modeling, simulation, and optimization of biological systems •Robustness and evolvability of biological networks •Emergent properties in complex biological systems •Ecoinformatics and applications to ecological data analysis •Medical imaging and pattern recognition •Medical image analysis •Biomedical data modeling and mining •Treatment optimization •Biomedical model parameterization •Brain computer interface  The use of computational intelligence must play a substantial role in submitted papers. Submissions will be peer reviewed and accepted papers will be published in the conference proceedings and will be indexed in IEEE Xplorer. Selected papers, after a substantial extension, will be considered for publication in special issue of Elsevier’s Biosystems journal.  Prospective authors are invited to submit papers in IEEE format, including results, figures, and references. Accepted papers longer than eight pages will have an additional per page charge. Submission details can be found at: http://www.federation.edu.au/cibcb2021  Depending on prevailing situation, the conference will be either face to face, virtual or a combination of both. For additional information, contact the Conference Secretariat at Federation University, Australia via Email: cibcb2021@federation.edu.au"}, {"Conference": "DCAC  2021 : Digital Culture & AudioVisual Challenges - Interdisciplinary Creativity in Arts and Technology", "Link": "https://avarts.ionio.gr/dcac/", "Deadline": "2021-03-31", "Notice": null, "Begin": "2021-05-28", "End": "2021-05-29", "AbstractRegistrationDue": null, "NotificationDue": "N/A", "FinalVersionDue": "N/A", "Extended": null, "Location": "Corfu, Greece & Virtual", "Categories": "ART AND TECHNOLOGY   audio-visual and multimedia de   digital art (computer art, ani   human-computer interaction, (h", "CallForPapers": "Welcome to the 3rd International Conference on Digital Culture & AudioVisual Challenges. DCAC-2021 will again afford an exceptional opportunity for renewing old acquaintances, making new contacts, offering a worldwide connection between researchers and lecturers, from a wide range of academic fields, facilitating partnerships across national and disciplinary borders. This year the International Conference on Digital Culture & AudioVisual Challenges will be held online. It is hosted by the Department of Audio & Visual Arts (Ionian University) and depending on the pandemic circumstances there will be an option for physical presence.  The aim of the DCAC-2021 is to bring together technology, art and culture in the Digital Era, as well as to provide a forum on current research and applications incorporating technology, art and culture, to deepen cooperation, exchange experiences and good practices.  Researchers, artists and scholars are encouraged to participate in the discussion about the interaction between interdisciplinary creativity, technology, arts and culture. Authors are invited to present original papers for oral or poster presentation in the fields of New Media Arts and Digital Culture.  Topics of the Conference include (but not limited to):  - Algorithmic Art - Algorithmic music composition - Art and Culture Analysis - Art and Technology - Art and cultural promotion and dissemination - Art, Technology and Education (Creative Technologies) - Artificial Intelligence in Arts - Artistic Applications in Art and Technology - Audio-Visual and Multimedia Design - Collaborative and adaptive environments for Artistic creation and/or dissemination - Cybernetics in Contemporary Art - Data Visualization - Digital Art (computer art, animation, virtual art, internet art, pixel art, interactive art, 3Dprinting) - Digital Preservation - e-Learning in Art and Media Studies - Electronic Music - Experimental Art & Cultural product - Gaming - Holography & Hologram Technology - Human-Computer Interaction, (human‐computer interfaces, ubiquitous, natural and adaptive interfaces, assistive technologies) - Internet Culture - Media Literacy and Media Studies - New Aesthetic - Robotics - Virtual Reality - Augmented Reality - Mixed Reality"}, {"Conference": "SNTA  2021 : The Fourth International Workshop on Systems and Network Telemetry and Analytics (SNTA 2021)", "Link": "https://sdm.lbl.gov/snta/2021/", "Deadline": "2021-03-31", "Notice": null, "Begin": "2021-06-21", "End": "2021-06-21", "AbstractRegistrationDue": null, "NotificationDue": "2021-04-18", "FinalVersionDue": "N/A", "Extended": null, "Location": "Virtual (in conjunction with ACM HPDC)", "Categories": "big data   distributed systems   security   machine learning", "CallForPapers": "The Fourth International Workshop on Systems and Network Telemetry and Analytics (SNTA 2021)  Web: https://sdm.lbl.gov/snta/2021/  Important Dates  Submission deadline: March 31, 2021 (extended) Author notification: April 18, 2021 Camera-ready deadline: May 2, 2021 Workshop: June 21, 2021  Scope: The tasks  of systems and  network telemetry are a key element for effective operations and management of HPC and distributed computing systems, by offering comprehensive measurement and analysis capabilities to provide the visibility into what is occurring at any time. The tasks will be significantly complicated with the greater complexity of computing systems, increasing network speed, and the newly introduced mobile and IoT devices. Such changes will render the existing telemetry and analysis techniques to be outdated, and more scalable techniques may be in place for data-driven and deeper data analysis. In addition to the quantitative and qualitative challenges, data pressure in systems and networks also  comes  from  various sources such  as sensors,  computing systems,  networking and security devices, and other \\emerging computing elements speaking with different syntax  and  semantics,  which  makes  organizing  and  incorporating  the  generated  data  difficult  for  extensive  analysis.  This workshop aims at bridging  the  systems and network measurement and the latest advances  in  machine  learning  and data science  technologies,  to  advance the  performance  and reliability of HPC and distributed systems. New analysis techniques are needed in the modern world, from the diverse angles of systems/network performance, availability, and security. For example, real-time streaming analytics algorithms and methods need to be explored for estimating network performance and summarizing the traffic variables to capture the network activities due to the network bandwidth increase. Multivariate analysis of telemetric variables may be able to provide the intuitive, comprehensive view of the systems and networks dynamics. New logging techniques are also needed in the future with the latest development in the storage and archival technologies. In addition, many applications in this area may need to address the application-specific requirements and challenges. This workshop intends to share visions of investigating new approaches and methods at the intersection of data sciences and HPC/distributed computing systems.   Topic of interest (but not limited to):  - Systems and network measurement, analysis, and summarization - HPC, superfacility, and distributed systems - Data-driven, multivariate, streaming-based data processing - Distributed and federated machine learning - Performance modeling, analysis, and engineering - Cybersecurity, forensics, privacy, and anonymization - Intelligent workflow, visualization, and applications - Smart instruments, edge/fog-systems, and IoTs - Wireless, mobile/5G networks - Software-Defined-* technologies - Storage and archival technologies - Experiences and practices on systems/network data analysis"}, {"Conference": "TORACLE  2021 : The 1st International Workshop on Test Oracles", "Link": "https://toracle2021.github.io/ ", "Deadline": "2021-06-01", "Notice": null, "Begin": "2021-08-23", "End": "2021-08-27", "AbstractRegistrationDue": null, "NotificationDue": "2021-07-01", "FinalVersionDue": "N/A", "Extended": null, "Location": "Athens, Greece.Athee", "Categories": "software engineering   software testing   test oracle", "CallForPapers": "*********************************** CFP Call For Papers  TORACLE 2021: The 1st International Workshop on Test Oracles  Co-located with The ACM Joint European Software Engineering Conference and Symposium on the Foundations of Software Engineering (ESEC/FSE 2021)  Website workshop: https://toracle2021.github.io/  Website conference: https://2021.esec-fse.org/  Twitter: @TOracle2021  **********************************  The challenge of distinguishing correct from incorrect test executions is called the test oracle problem and it is recognised as one of the fundamental challenges in software testing. For the first time TORACLE 2021 will bring together researchers and practitioners working on the techniques, approaches and tools related to the alleviation and automation of the oracle problem. The workshop will enable the participants to present ideas, discuss recent results and develop a shared agenda for future research.  TORACLE calls for high quality papers related to the test oracle problem.  TOPICS Automated generation of test case assertion oracles. Automated generation of contracts, program assertions, invariants, pre and post-conditions. Metrics and techniques for assessing the quality of oracles. Oracles for specific types of software systems such as deep learning systems, machine learning systems, cyber-physical systems, web applications, and mobile applications. Automated improvement of test oracles. Automated extraction of oracles from various natural language sources. Metamorphic oracles. Oracles for non-functional properties, such as security, performance. Oracle-based coverage criteria. Empirical evaluations of oracle-related techniques in real-world scenarios. Techniques for reducing the cost of manually deriving test oracles. Theoretical formalisation and analysis of the oracle problem.  SUBMISSIONS  We accept the following types of submissions:  Long papers - 10-page papers (including references and appendices) that present authors' original research work and results.  Short papers - 4-page papers (including references and appendices) that present one of the following:  Position and Vision Paper – to propose radical, innovative new ideas, arguments, and research directions.   Work-in-Progress Paper – to describe novel work that is not at the same level of research maturity as a full submission.  Industrial and Experience Paper – to describe the experience gained from applying/evaluating techniques to alleviate the oracle problem in an industrial context.  Demonstration Paper – to describe new research tools, data, and other artifacts related to the test oracle problem. We also encourage the submission of demonstrations of already published research techniques. However, a demonstration paper submission must not have been previously published in a demonstration form.  Authors of accepted papers can choose to give either a presentation or a live demonstration.    TORACLE 2021 will employ a double-blind review process. The papers submitted must not reveal the authors’ identities in any way. The authors’ names must be omitted from the submission, and references to their prior work should be made in the third person. The only exception are Demonstration papers, which will  employ a single-blind review process. The demonstration papers submitted do not need to hide the authors’ identities.  All papers must conform to the ESEC/FSE 2021 formatting instructions: https://2021.esec-fse.org/track/fse-2021-how-to-submit#submission-policies The page limit is strict.  Submitted papers must be written in English and in PDF format. They must be unpublished and not submitted for publication elsewhere. Papers must be submitted electronically through the submission site: http://esecfse2021-toracle.hotcrp.com/   Each submission will be reviewed by three members of the program committee. The main evaluation criteria include the relevance and quality of the submission in terms of technical soundness, novelty, relevance for the TORACLE audience, and presentation quality.  Accepted contributions will be included in the ESEC/FSE 2021 proceedings.  For more information visit the workshop website https://toracle2021.github.io/ If you have doubts about your submission being in the scope of the workshop, do not hesitate to contact the organisers.   IMPORTANT DATES Paper submission deadline:              June 1, 2021 Notification:                           July 1, 2021 Camera ready:                           July, 8 2021 Conference dates:                       August 23 - 27, 2021 Athens, Greece  ORGANIZERS Gunel Jahangirova Università della Svizzera italiana (USI), Lugano, Switzerland gunel.jahangirova@usi.ch  https://sites.google.com/view/guneljahangirova   Valerio Terragni University of Auckland, Auckland, New Zealand v.terragni@auckland.ac.nz  https://valerio65.github.io/"}, {"Conference": "CMAI  2021 : 3rd International Workshop on Conceptual Modeling Meets Artificial Intelligence", "Link": "https://workshop-cmai.github.io/2021/", "Deadline": "2021-06-16", "Notice": null, "Begin": "2021-10-18", "End": "2021-10-21", "AbstractRegistrationDue": null, "NotificationDue": "2021-07-15", "FinalVersionDue": "N/A", "Extended": null, "Location": "St. John's, NL, Canada", "Categories": "conceptual modelling   artificial intelligence (ai)   explainable ai (xai)   model generation", "CallForPapers": "Co-Located with the 40th International Conference on Conceptual Modeling (ER 2021), 18-21 October 2021 St. John's, Canada: https://er2021.org  Call for Papers -------------- Artificial intelligence (AI) is front and center in the data-driven revolution that has been taking place in the last couple of years with the increasing availability of large amounts of data (“big data”) in virtually every domain. The now dominant paradigm of data-driven AI, powered by sophisticated machine learning algorithms, employs big data to build intelligent applications and support fact-based decision making. The focus of data-driven AI is on learning (domain) models and keeping those models up-to-date by using statistical methods over big data, in contrast to the manual modeling approach prevalent in traditional, knowledge-based AI.  While data-driven AI has led to significant breakthroughs, it also comes with a number of disadvantages. First, models generated by machine learning algorithms often cannot be inspected and understood by a human being, thus lacking explainability. Furthermore, integration of preexisting domain knowledge into learned models – prior to or after learning – is difficult. Finally, correct application of data-driven AI depends on the domain, problem, and organizational context while considering human aspects as well. Conceptual modeling can be the key to applying data-driven AI in a meaningful, correct, and time-efficient way while improving maintainability, usability, and explainability.  Topics of Interest ----------------- The topics of interest include, but are not limited to, the following: - Combining generated and manually engineered models - Combining symbolic with sub-symbolic models - Conceptual (meta-)models as background knowledge for model learning - Conceptual models for enabling explainability, model validation and plausibility checking - Trade-off between interpretability and model performance - Reasoning in generated models - Data-driven modeling support - Learning of meta-models - Automatic, incremental model adaptation - Case-based reasoning in the context of model generation and conceptual modeling - Model-driven guidance and support for data analytics lifecycle - Conceptual models for supporting users with conducting data analysis  Workshop Organizers ------------------ Dominik Bork, TU Wien, Austria Peter Fettke, German Research Center for Artificial Intelligence, Saarland University, Germany Ulrich Reimer, Eastern Switzerland University of Applied Sciences, Switzerland Marina Tropmann-Frick, University of Applied Sciences Hamburg, Germany"}, {"Conference": "STRIVE  2021 : The Fourth Intl. Workshop on Safety, securiTy, and pRivacy In automotiVe systEms", "Link": "http://hosting.services.iit.cnr.it/strive2021/", "Deadline": "2021-05-10", "Notice": null, "Begin": "2021-09-07", "End": "2021-09-07", "AbstractRegistrationDue": null, "NotificationDue": "2021-06-30", "FinalVersionDue": "N/A", "Extended": null, "Location": "Wien, Austria", "Categories": "cyber physical systems   automotive   IOT   cyber security", "CallForPapers": "The Fourth Intl. Workshop on Safety, securiTy, and pRivacy In automotiVe systEms STRIVE 2021  co-located with Euro S&P September 7th, 2021, Wien, Austria http://www.iit.cnr.it/strive2021   Scope: The introduction of ICT systems into vehicles make them more prone to cyber-security attacks. Such attacks may impact on vehicles capability and, consequently, on the safety of drivers, passengers. The strong integration among dedicated ICT devices, the physical environment, and the networking infrastructure, leads to consider modern vehicles as Cyber-Physical Systems (CPS). This workshop aims at providing a forum for researchers and engineers in academia and industry to foster an exchange of research results, experiences, and products in the automotive domain from both a theoretical and practical perspective. Its ultimate goal is to envision new trends and ideas about aspects of designing, implementing, and evaluating innovative solutions for CPS with a particular focus on the new generation of vehicles. Indeed, the automotive domain presents several challenges in the fields of vehicular network, Internet of Things, Privacy, as well as Safety and Security methods and approaches. The workshop aims at presenting the advancement on the state of art in these fields and spreading their adoption in several scenarios involving main stockholders of the automotive domain.  The list of relevant topics includes (may be not limited to): - Architecture, design, and implementation of safe and secure Cyber-Physical Systems;  - Automated Vehicular Technologies; - Vehicular Communications and Networks; - In-Vehicle communication protocols; - User-to-Vehicle interactions and communications; - Software Process Development in Automotive systems; - Security threats and vulnerabilities of Cyber-Physical Systems; - Safety and Security Trade-off and Convergences; - Cooperative/collaborative vehicular systems; - Cyber-security solutions for connected and autonomous vehicles; - Privacy of vehicular data; - Driver behaviour characterization; - Standardization and Interoperability.  Welcome domains of application are (may be not limited to):  - Automotive; - Vehicular Network; - Internet of Things; - Cyber-Physical Systems; - Smart cities and Smart environment.  Important dates: Submission deadline: 10th, May 2021  Notification of authors: 30th, June 2021  Camera-ready copy due: 16th, July 2021  Submissions and Publication: Submitted papers must be written in English and must contain results that have not previously published nor concurrently submitted to a journal or conference with published proceedings. Submissions, as pdf files, must not exceed 6 pages of text (excluding references). Reviewers are explicitly not expected to read the appendices while deciding whether to accept or reject the paper. Papers must be typeset in LaTeX in A4 format (not “US Letter”) using the IEEE EuroS&P conference proceeding template and must follow the guidelines of the main conference. Papers must be submitted electronically through EasyChair by using the following link: https://easychair.org/conferences/submissions?a=26100098 Accepted papers will be published through IEEE Xplore in a volume accompanying the main IEEE EuroS&P 2021 proceedings.  Workshop Chairs Gianpiero Costantino, IIT-CNR, Italy  Ilaria Matteucci, IIT-CNR, Italy  Programme Committee Giampaolo Bella, Univesity of Catania, Italy  Pietro Biondi, Univesity of Catania, Italy  Jeremy Bryans, Coventry University, UK Gianpiero Costantino, IIT-CNR, Italy (Co-Chair) Bogdan Groza, Politehnica University of Timisoara, Romania  Sandeep Gupta, University of Trento, Italy Mathias Johanson, Alkit, Sweden Eriche Leitgeb, University of Graz, Austria John Mace, University of Newcastle, UK Eda Marchetti, ISTI-CNR, Italy Ilaria Matteucci, IIT-CNR, Italy (Co-Chair)  Francesco Mercaldo, IIT-CNR, Italy Davide Micale, Univesity of Catania, Italy  Paolo Santi, MIT, US Francesco Santini, University of Perugia, Italy  Stefano Sebastio, Raytheon Technologies, Ireland  Daniele Sgandurra, Huawei, Germany Renaud Sirdey, CEA, France"}]