[
    {
        "conference": "MMMT 2021: International Conference on Machining, Materials and Mechanical Technologies",
        "website": "http://www.mmmt2021.org/",
        "deadline": [
            "2021-03-22"
        ],
        "extended": "Extended",
        "notice": [
            "2021-03-29"
        ],
        "begin": [
            "2021-03-29"
        ],
        "location": "Shanghai, China",
        "tag": "Viewed: 280593   Tracked: 5   Attend: 5",
        "call_for_papers": " ---Welcome to MMMT2021----  2021 International Conference on Machining, Materials and Mechanical Technologies (MMMT2021) will take place in Shanghai, China during March 29-30, 2021. It will provide a platform for educators, scholars, managers and graduate students from different cultural backgrounds to present and discuss research, developments and innovations in their academic fields. Sincerely welcome prospective scholars to submit their novel research or technological contributions to MMMT2021 and share their valuable experiences with other scientists and students from all over the world.    ---Paper Publication-----  Papers submitted to MMMT2021 will be reviewed by technical committees of the conference. All accepted and registered papers will be published in the Journal of Materials Science Forum [ISSN print 0255-5476, ISSN web 1662-9752]. And the press will submit all papers to major databases such as EI Compendex, Scopus, SCImago Journal & Country Rank (SJR), Inspec, Cambridge Scientific Abstracts, ProQuest, EBSCO, WorldCat, Google Scholar, and CNKI Scholar and so on. We sincerely invite you to join MMMT2021, and welcome your submitting. For a few authors who don't expect any publication of your papers, you're welcome to submit the abstracts to us which will be sent to at least two technical committees for a brief review, and present your abstract at the conference without publishing.    ----Paper Submission-------  Please send your Paper(s) to MMMT2021 via email:  submit@mmmt2021.org or  mmmt2021@sina.com, the email subject should be named \"Submission+Name+Tel\".   Regular papers are allowed to 6 pages. Extra pages(exceed 6 pages) will incur additional charges. Notice: It is not compulsory for you to attend the conference, it does not affect your paper the publication and indexed.    ----Call for Papers----  All submissions will be blind reviewed by the Technical Committees on the basis of technical quality, relevance to conference topics of interest, originality, significance, and clarity. By submitting your manuscript to the MMMT2021, it is understood that this it is an original manuscript and is unpublished work and is not under consideration elsewhere. Plagiarism, including duplicate publication of the author's own work, in whole or in part without proper citation is not tolerated by the conference.    Topics of interest for submission include, but are not limited to:  1: Materials Science and Engineering      • Computational materials science  • Engineering apllications of materials  • Global materials science market  • Graphene Technology  • Carbon nano structures and devices  • Coatings, surfaces snd membranes  • Biomimetic materials  • Fiber, films and membranes  • Polymeric biomaterials  • Applications of Materials Science  • Emerging Technologies in Materials Science  • Materials Synthesis  • Materials Processing  • Materials Characterization  • Industrial materials  • Materials Physics and Chemistry  • Materials and Design  • Novel Materials, Multifunctional Materials  • Quantum Materials  • Materials Innovation and Development  • Green Technology  • Optoelectric and Magnetic Materials  • 3D/4D Printing Technologies      2: Nanomaterials and Nanotechnology    • Nano-Alloys  • Nano/Meso-Structured Carbon Materials  • Nanostructured Materials  • Nanofabrication  • Functional Nanomaterials  • Nanotechnology for Energy and the Environment  • Nanochemistry  • Green Nanotechnology  • Nano Engineering  • Nanomaterials, biomaterials & synthesis  • Carbon nanotechnology  • Nanochemistry & Wet Nanotechnology  • Nanotechnology in Structural Biology  • Biomaterials and Nano biotechnology  • Organic and Inorganic Nano materials  • Nano devices, Nano electronics and Nano sensors  • Synthesis of nanomaterials and properties  • Thin Films, nanotubes and nanowires  • Carbon nano structures and devices  • Nanoelectronics  • Nano and microfibrillated cellulose  • Micro, nano and bio fluidics      3: Energy Materials    • Materials and Technologies for Energy Conversion.  • Electrochemical energy storage  • Energy Materials: Synthesis and Characterization  • Energy materials storage and fuel Cells  • Materials for hydrogen production  • Hybrid materials for energy storage and conversion  • Fuel Cell Electric Vehicles (FCEV)  • Solar Energy Materials  • Solar Systems Integration  • Concentrating Solar Thermal for Electricity, Chemicals, and Fuels  • Photovoltaic Materials, Devices, Modules, and Systems  • Solar Thermal  • Fuel cells and Biofuels  • Photocatalysis and Electrocatalysis  • Batteries, Supercapacitors and Solid   •Electrolyte Materials  • CO2 Capture, Storage & Conversion  • Bioenergy  • Geothermal Energy  • Renewable Fuels    4: Composite & Ceramic Materials      • Composite & Ceramic Materials: Synthesis and Characterization  • Composite & Ceramic Materials: Structure and Design  • Nano-Composites and Nano-Ceramics  • Ceramic-Matrix Composites  • Polymer Matrix Composites  • Composite & Ceramic Engineering  • Glass Engineering and Science  • Ceramic Coating  • Ceramic Cutting Tools  • Ceramic Films and Coatings  • Ceramic Lasers  • Nanoceramics  • Bioceramics  • Advanced Ceramics  • Brick and Structural Clay  • Refractories  • Ceramic art  • Clay Ceramics  • Structural Ceramics      5: Polymer Science and Technology      • Ring-opening metathesis polymerization  • Biocatalysis, enzyme synthesis, biological organisms for synthesizing monomers and polymers  • Plastics and the Environment  • Biopolymers  • Electrospinning of Carbon Nanotube Reinforced Polymeric Materials  • Lasers in Polymer Science and Technology  • Polymer Matrix Composites and Technology  • Metal Matrix Composites and Technology  • Ceramics Matrix Composites and Technology  • Polymer Chemistry  • Polymer Design and Modelling  • Polymer Nanocomposites  • Advanced Polymer Structures  • Chemical and Mechanical Properties of Polymer  • Polymer Rheology  • Bio-Polymers  • Applications of Polymers  • Recent innovations in Polymer Science and Technologies  • Polymer Industry      6: Composite Materials     • Advanced Composite Materials  • Automotive Composites  • Polymer Composites  • Ceramic Based Composites  • Nanocomposites  • Biocomposites  • Metal matrix Composites  • Polymer matrix Composites  • Ceramic matrix Composites  • Biomedical Composites  • Carbon Matrix Composites  • Multi-functional Composites  • Nanotechnology Composites  • Textile Composites  • Green Composites  • Mechanical Properties  • Composites Manufacturing  • Applications of Composites    7: Surface Science And Engineering      • Thin Films, Materials Surface & Interfaces  • Surface and Interface Phenomena  • Surface and Interface Analysis and Properties  • Nanostructured Materials, Micelles, and Colloids  • Solid Thin Films and Layers  • Thin Film Growth & Epitaxy  • Surface Coating Technology  • Corrosion Engineering  • Tribology  • Surface characterization  • Interfaces and thin films  • Nanostructured materials  • Smart applications of surfaces and interfaces  • Applied Surface Science  • Surfaces and Interfaces  • Coatings and surface treatments    8: Smart Materials And Applications      • Renewable smart materials  • Smart materials and structures  • Graphene-based smart materials  • Smart Functional Nanoenergetic Materials  • Smart building materials and structures  • Smart biomaterials  • Smart Materials and Structures  • Advances in Smart Materials and Applications  • Magnetic smart materials  • Piezoelectrics: Piezoelectric materials convert electrical energy to mechanical energy, and vice versa.  • Shape Memory Alloys  • Magnetostrictive  • Shape Memory Polymers  • Electroactive Polymers  • Bi-Component Fiber  • Semiconductor Photocatalysis      9: Advanced Materials and Nanotechnology     • Advanced Engineering Materials  • Advanced Functional Materials  • Advanced Energy Materials  • Advanced Healthcare Materials  • Advanced Optical Materials  • Advanced Materials Interfaces  • Advanced Electronic Materials  • Advanced Materials Technologies    Track 10: Mechanical Engineering    •Precision mechanics, mechatronics  • Mechanical Manufacturing and automation   • Mechanics of Applied-Statics and Dynamics   • Mechanics of Solid   • Mechanical-electronic engineering   • Mechanical power engineering   • Mechanical Technologies    • Dynamics of Mechanical Systems    • Material shaping and controlling engineering  Last updated by Julie  Julia  in 2021-03-11 "
    },
    {
        "conference": "ARCS 2021: International Conference on Architecture of Computing Systems",
        "website": "https://arcs-conference.org/",
        "deadline": [
            "2021-03-22"
        ],
        "extended": "Extended",
        "notice": [
            "2021-05-10"
        ],
        "begin": [
            "2021-06-07"
        ],
        "location": "Online",
        "tag": "QUALIS: b2   Viewed: 11590   Tracked: 3   Attend: 0",
        "call_for_papers": " Topics of Interest    A wide range of HW/SW aspects of “Advanced Computing Architectures” including (but are not limited to):        Hardware Architectures          (3D) System-on-chip          Distributed systems          Multi- and many-core architectures          Heterogeneous computing          (Runtime) reconfigurable architectures          Advanced computing architectures          Emerging memory technologies      Programming Models and Runtime Environments          Domain-specific languages and programming models          Operating systems, hypervisors and middleware for homogeneous and heterogeneous multi-/many-core computing platforms          System management including but not limited to scheduling, memory management, power/thermal management, and RTOS      Cross-sectional Topics          Adaptive systems (energy aware, self-x technologies)          Pervasive systems          Autonomous systems          Mixed-criticality systems          Organic Computing          Approximate Computing          Support for safety and security  Last updated by Dou Sun in 2021-03-14 "
    },
    {
        "conference": "CAIC 2021: International Conference on Control, Automation and Intelligent Computing",
        "website": "http://www.caic2021.org/",
        "deadline": [
            "2021-03-23"
        ],
        "extended": "Extended",
        "notice": [],
        "begin": [
            "2021-05-28"
        ],
        "location": "Beijing, China",
        "tag": "Viewed: 1120   Tracked: 0   Attend: 0",
        "call_for_papers": " 2021 International Conference on Control, Automation and Intelligent Computing (CAIC2021) is an excellent forum for people who have certain research in this filed. Prospective authors are cordially invited to participate this conference by submitting papers to us. There are some related topics for reference. Topics for submission include, but not limited to:    Topic 1: Control  Control of Biological Systems  Precision Motion Control  Control Applications  Control Engineering Education  Industrial Process Control  Automated Guided Vehicles  Control Theory and Applications Optoelectronics  Instruments and Vibration Control  Intelligent and AI Based Control  Material Processing and Control  Process Control & Instrumentation  Sensor Networks and Networked Control  Adaptive Control  Robust Control  Process Control  Networked Control Systems  Complex Systems  Co-operative Control  Precision Motion Control  Identification and Estimation  Fault Detection    Topic: 2: Automation  Factory Modeling and Automation  Process Automation  Intelligent Automation  Home, Laboratory and Service Automation  Manufacturing Control and Automation Engineering  Man-machine Interactions  Factory Modeling and Simulation  Nano-scale Automation and Assembly  Instrumentation Systems  Network-based Systems  Planning, Scheduling and Coordination  Biomedical Instrumentation and Applications  Discrete Event Systems  Hybrid Systems  Delay Systems  Nonlinear Systems  Intelligent Systems  Real-time Systems  Flexible Manufacturing Systems  Fuzzy Systems  Modeling of Complex Systems    Topic 3: Intelligent Computing  Algorithms and Theories  Artificial Intelligence  Internet & Cloud Computing  Web and Internet Computing  Bioinformatics Algorithms & Databases Biostatistics  Nature Inspired Computing and Optimization  Computational Neuroscience  Evolutionary Computation and Learning  Big Data Processing in Biology  Genetic Algorithms  Evolutionary Computation and Control  Optimization Algorithms  Soft Computing  Software Agents for Intelligent Control Systems  Neural Networks based Control Systems  Robotics and Automation  Network Robotics  Robot Design, Development and Control  Control and Supervision Systems  Vehicle Control Applications  Human-Robots Interfaces    Other Related Topics  Last updated by CAIC 2021 in 2021-03-11 "
    },
    {
        "conference": "KR 2021: International Conference on the Principles of Knowledge Representation and Reasoning",
        "website": "https://kr2021.kbsg.rwth-aachen.de/",
        "deadline": [
            "2021-03-24"
        ],
        "extended": "N/A",
        "notice": [
            "2021-06-15"
        ],
        "begin": [
            "2021-11-06"
        ],
        "location": "Hanoi, Vietnam",
        "tag": "CCF: b   CORE: a*   QUALIS: a2   Viewed: 17824   Tracked: 79   Attend: 4",
        "call_for_papers": " Knowledge Representation and Reasoning (KR) is a well-established and lively field of research. In KR a fundamental assumption is that an agent's knowledge is explicitly represented in a declarative form, suitable for processing by dedicated reasoning engines. This assumption, that much of what an agent deals with is knowledge-based, is common in many modern intelligent systems. Consequently, KR has contributed to the theory and practice of various areas in AI, including automated planning and natural language understanding, and to fields beyond AI, including databases, verification, software engineering, and robotics. In recent years, KR has contributed also to new and emerging fields, including the semantic web, computational biology, cyber security, and the development of software agents.     The KR conference series is the leading forum for timely in-depth presentation of progress in the theory and principles underlying the representation and computational management of knowledge.     Scope     We solicit papers presenting novel results on the principles of KR that clearly contribute to the formal foundations of relevant problems or show the applicability of results to implemented or implementable systems. We also welcome papers from other areas that show clear use of, or contributions to, the principles or practice of KR.     Topics of interest include, but are not limited to:     Applications of KR   Argumentation   Belief revision and update, belief merging, information fusion   Commonsense reasoning   Computational aspects of knowledge representation   Concept formation, similarity-based reasoning   Contextual reasoning   Decision making   Description logics   Explanation finding, diagnosis, causal reasoning, abduction   Geometric, spatial, and temporal reasoning   Inconsistency- and exception-tolerant reasoning, paraconsistent logics   KR and autonomous agents and multi-agent systems   KR and cognitive robotics   KR and cyber security   KR and education   KR and game theory   KR and machine learning, inductive logic programming, knowledge acquisition   KR and natural language processing and understanding   KR and the Web, Semantic Web   Knowledge graphs and open linked data   Knowledge representation languages   Logic programming, answer set programming   Modeling and reasoning about preferences   Multi- and order-sorted representations and reasoning   Nonmonotonic logics, default logics, conditional logics   Ontology formalisms and models   Ontology-based data access, integration, and exchange   Philosophical foundations of KR   Qualitative reasoning, reasoning about physical systems   Reasoning about actions and change, action languages   Reasoning about constraints, constraint programming   Reasoning about knowledge, beliefs, and other mental attitudes   Uncertainty, vagueness, many-valued and fuzzy logics  Last updated by Dou Sun in 2021-01-19 "
    },
    {
        "conference": "ICMET 2021: International Conference on Mechanical and Electrical Technology",
        "website": "http://www.icmet.ac.cn",
        "deadline": [
            "2021-03-25"
        ],
        "extended": "Extended",
        "notice": [],
        "begin": [
            "2021-04-02"
        ],
        "location": "Tokyo, Japan",
        "tag": "Viewed: 4734   Tracked: 0   Attend: 1",
        "call_for_papers": " Topics Include    1. Mechanical and Mechatronics Engineering and Technologies  • 1.1 Mechanics  • 1.2 Mechatronics and robotics  • 1.3 Structural analysis  • 1.4 Thermodynamics and thermo-science  • 1.5 Design and drafting  • 1.6 Biomechanics  • 1.7 Micro- and Nano-Systems Engineering and Packaging  • 1.8 Systems, Design, and Complexity  • 1.9 Transportation Systems  • 1.10 Vibration, Acoustics and Wave Propagation    2. Electrical Engineering  • 2.1 Integrated Circuits & Power Electronics  • 2.2 Energy Harvesting & Conversion  • 2.3 Optics, Nanophotonics & Quantum Tech  • 2.4 Nanotechnology & NEMS/MEMS  • 2.5 Electronic Devices and Instrumentation  • 2.6 Energy-Efficient Hardware Systems  • 2.7 Control & Optimization  • 2.8 Microelectronics  • 2.9 Circuits and Systems  • 2.10 Electrical Machines and Drive Systems  • 2.11 Electric Vehicle Technologies  • 2.12 High Voltage and Insulation Technologies  • 2.13 Drive Systems  • 2.14 Power Quality and Electromagnetic Compatibility  • 2.15 Power System Reliability and Security  • 2.16 Power Systems Communication  • 2.17 Semiconductor Technology  Last updated by Dou Sun in 2021-03-14 "
    },
    {
        "conference": "MEIE 2021: International Conference on Mechanical, Electric and Industrial Engineering",
        "website": "http://www.icmeie.com/",
        "deadline": [
            "2021-03-25"
        ],
        "extended": "N/A",
        "notice": [],
        "begin": [
            "2021-05-22"
        ],
        "location": "Kunming, China",
        "tag": "Viewed: 10892   Tracked: 4   Attend: 2",
        "call_for_papers": " The Fourth International Conference on Mechanical, Electric and Industrial Engineering (MEIE2021) will be held in Kunming, China during May 22-24, 2021.    MEIE2021 aims to provide an annual platform for scholars, experts and researchers from worldwide, to exchange their experiences and latest findings in the fields of mechanical engineering, electric engineering or industrial engineering. All full paper submitted to the MEIE2021 will be peer reviewed and evaluated based on originality, technical, research content, research depth, correctness, relevance to conference, contributions and readability.    On behalf of the organizing committee, we cordially invite researchers, engineers, academicians as well as industrial professionals to participate in MEIE2021.     The papers may include but are not limited to:    Mechanical:  Biomechanics  Robotics  General Mechanics  CAD/CAM/CIM  Structural Analysis  Fuels and Combustion  Dynamics and Vibration  Computational Fluid Dynamics  Design and Drafting  Acoustic Engineering  Machinery and Machine Design  Fluid Mechanics and Machinery  Mechanical and Electrical Integration  Thermodynamics  Mechanical Power Engineering  Applied Mechanics    Electric:  Microelectronics  Signals and Systems  Electrical Machinery  Power System Analysis  Automatic Control Principle  Automatic Control System  Electronic Circuits  Insulation Technology  Microcomputer Principle and Application  Power Electronic Technology  Analog Electronic Technology  Electromagnetic and Photonics  Microcomputer Control Technology  Digital Electronic Technology  Electrical Control Technology  HVDC Transmission Technology  High Voltage Technology    Industrial Engineering:  Ergonomics  Industrial Simulation  Process Engineering  Engineering Design  Industrial Manufacturing Design  Quality Engineering  Systems Engineering  Manufacturing System Engineering    Note:    The submitted paper must be original and unpublished. Any manuscripts out of the conference's scope, containing plagiarism (including self-plagiarism) or be in considered by other journal will be rejected.  Last updated by Dou Sun in 2020-08-06 "
    },
    {
        "conference": "CCAI 2021: International Conference on Computer Communication and Artificial Intelligence",
        "website": "http://www.ccai.net",
        "deadline": [
            "2021-03-25"
        ],
        "extended": "Extended",
        "notice": [
            "2021-04-10"
        ],
        "begin": [
            "2021-05-07"
        ],
        "location": "Guangzhou, China",
        "tag": "Viewed: 1912   Tracked: 6   Attend: 1",
        "call_for_papers": " The CCAI 2021 is the premier interdisciplinary platform for the presentation of new advances and research results in the fields of Computer Communication and Artificial Intelligence. The conference will bring together leading academic scientists, researchers and scholars in the domain of interest from around the world.     Topics of interest for submission include, but are not limited to:    Computer Communication        Artificial Intelligence and Machine Learning      Blockchain Technology      Computer Architecture      High-Performance Computing      Information and Its Technical Education      Mobile and Ubiquitous Computing      Parallel and Distributing Computing      Software Engineering and Knowledge Engineering      Virtual Reality and Visualization      Autonomic and Trusted Computing      AI in Communication      Big Data      Biomedical Informatics and Computation      Data Compression      Image Processing      Mobile Computing      Network Security and Cryptography      Robotics Technology      Knowledge Discovery and Data Mining      Wireless and Sensor Devices      RF and Microwave Communication      Microwave Theory and Techniques      Integrated Optics and Electro-optics Devices      Signal, Image and Video Processing      Network Communication and many more      RF, Microwave and millimeter circuit      Electromagnetic and Photonics      Signal Detection and Parameter Estimation      Communications Transmission      Antenna and Propagation      Remote Sensing and GPS      Techniques of Laser and Applications of Electro-optics      Wireless Communications      RF and Microwave devices      Modulation, Coding, and Channel Analysis      Optical Electronic Devices & Photonics      Speech and Audio Processing    Artificial Intelligence        Artificial Intelligence and Technology      Natural Language Processing      Computer Vision      Bioinformatics      Robotics and Related Fields      Expert Systems      Multi-agent Systems      Speech Understanding      Knowledge Engineering      Distributed Intelligent Processing      Concurrent and Parallel Processing      Intelligent Database Systems      Supervised and Unsupervised Learning      Neural Network Theory and Architectures      Hardware Implementations      Fuzzy Logic      Fuzzy Optimisation      Fuzzy Control      Fuzzy Computing with Words      Theory of Evolutionary Algorithms      Evolutionary Design      Evolutionary Scheduling and Optimisation      Rough Sets Theory: Foundations and Applications      Data Mining      Artificial Intelligence in Scheduling and Optimization      Artificial Intelligence in Modelling and Simulation      Various Applications  Last updated by Dou Sun in 2021-03-14 "
    },
    {
        "conference": "ICTC' 2021: Information Communication Technologies Conference",
        "website": "http://www.ictc.net/",
        "deadline": [
            "2021-03-25"
        ],
        "extended": "Extended",
        "notice": [
            "2021-04-10"
        ],
        "begin": [
            "2021-05-07"
        ],
        "location": "Nanjing, China",
        "tag": "Viewed: 2083   Tracked: 1   Attend: 1",
        "call_for_papers": " - Track 1: Quantum Computing and Blockchain, Queuing and Storage -    - Track 2: next generation communication and networking -    Networking for Cloud and Fog computing  Mobile Cloud Computing (MCC) and Multi-access Edge Computing (MEC)  Data center network architectures and performance  Software Defined Networking (SDN) and Network Function Virtualization (NFV)  NFV Management and Orchestration  Information Centric Networking (ICN)/ Named Data Networking (NDN)  Internet of Things (IoT), M2M, D2D, MTC  Content-centric networking: caching, naming, distribution, load balancing, resiliency, traffic engineering, congestion control  Future Internet and next-generation networking architectures  High speed and programmable architectures for next generation routers and switches  Mobile security: device, application, and data  Next-generation anomaly, intrusion, and attack detection/prevention  Heterogeneous multi-layer and multi-domain wireless-wireline internetworking  Free space optical (FSO) networks and Visible light communication (VLC)  Indoor localization and navigation  Intent-based network control and management  Internet economics, pricing, accounting, and growth modelling  Internet and network outages, robustness, survivability, and resilience  Integrated networking, storage, and computing  Networking flying vehicles such as UAVs and drones  Networked and Cloud Robotics  Next-generation access networks  Next-generation flow management: resource sharing, congestion control  Next-generation Internet applications and services, including virtual/augmented reality, interactive media, voice and video, games, and immersive applications  Next-generation IP multimedia subsystem: architecture and design  Next-generation networking protocols  Next-generation network management and control  Open Communities, Open API, Open Source  Operational and research issues with IPv6  Overlay and peer-to-peer (P2P) networking  Packet classification and forwarding mechanisms at ultra-high link rates  Quality of Service (QoS) and Quality of Experience (QoE) in next-generation networks  Resource orchestration in next-generation networks  Self-protection and self-organization networking  Addressing and naming with the presence of mobility and portability  Centralized-RAN, Could-RAN, and Fog-RAN architectures  Converged networks and applications    - Track 3: Communication, network and hardware -    Network Interface Virtualization  Network Virtualization Concept and Architecture  Green Datacenter  Higher layers of protocols, application  Physical and link layers and lower layers of protocols  Simulation, Modeling and analysis and performance evaluations  Network management and services  Optical Passive and Active components and devices  Security in Mobile and Wireless Networks  WLAN and Mobile WIMAX, 3G and 4G systems  Wireless Local Loop (WLL)  Multiple Access Technology  Broadband Wireless Access  Wireless Multimedia Services  Cost-effective Rural, Urban and Community Wireless and Mesh Networks  Networking and computing in challenged environment  Policies for communication access development  Sensor networks / alert systems  Mobile-based computing  Wireless, ad-hoc, meshed, etc. networks    - Track 4: Fuzzy Logic and Soft-Computing (Special Session) -    Soft Computing based Hybrid Systems  Fuzzy Set and Fuzzy Logic Theory  Neurocomputing  Chaotic Computing  Evolutionary Computing  Fuzzy Data Science  Decision Making with Imperfect Information  Applications of Fuzzy Logic and Soft computing in Economics, Engineering, Medicine, Business etc.    - Track 5: Data Science and Advanced Analytics -    Advanced Statistical Analytics  Software Techniques and Architectures in Cloud/Grid/Stream Computing  Domain-Specific Applications of Data Analytics  Programming Models and Environments for Cluster, Cloud, and Grid Computing to Support Big Data  MapReduce-based Solutions  New Computational Models for Big Data  Data Visualization at Scale  Forecast of Time Series  Game Data Science  Big Data Open Source Platforms  New Programming Models for Big Data beyond Hadoop/MapReduce  Software Systems to Support Big Data Computing  Data Management in the Social Web  Big Data as a Service  Big Data Industry Standards  Large-Scale data Management and Analysis  Big Data and Mobility  Big Data Analytics in Government, Public Sector and Society in General  Complex Big Data Applications in Verious Areas  Data-intensive Computing and MapReduce    - Track 6: Big Data Engineering -    Hadoop as a Large-scale Data-processing Technology  Text Mining and Analysis  New Data Standards  Semantic-based Data Mining and Data Pre-processing  Machine Learning and Data Mining  Social Web Search and Mining  Data Stream Processing at Scale  Data Pre-processing, Cleaning, Normalization  Auditing Big Data Sources  Large Scale Optimization  NoSQL as a new Database Paradigm  Data and Information Quality for Big Data  Visualization and Data Mining  Web-Mining  Mining Social Media  Business Intelligence and Data Mining  Social network analysis, theories, models, and applications  Algorithms and systems for Web-scale mining  Natural Language Processing and Information Retrieval  Unstructured Information Extraction from the Web    - Track 7: High Performance Computing and Machine Learning -    Parallel and Distributed Computing and Systems  Cluster and Grid Computing  Peer-to-Peer Architectures and Networks  High Performance Interconnection Networks  Partitioning, Mapping, and Scheduling  Load Balancing and Sharing  Fault Tolerance and Resilience in HPC Systems  Benchmarking and Performance Assessment in HPC  Virtualization and Virtual Machines  Learning and Intelligence Algorithms  Artificial Intelligence and Machine Learning at Scale  Machine Learning on GPUs, TPUs, CPUs  Deep Learning Techniques  Computer Vision and Pattern Recognition  Autonomous Vehicle Navigation  Facial Recognition and Expression Detection  Machine Learning in Robotics and Automation  Open Source Tools for Artificial Intelligence  Neural Networks and Deep Learning  Speech & Pattern Recognition    - Track 8: Cyber Security Issues -    High Performance Cryptography  Visualizing Large Scale Security Data  Privacy Preserving Big Data Collection/Analytics  Secure Software Development  Computer Network Security  Mobile Smart Phone and Tablet Security  The Nature of Web Application Hacking and New Security Trends  Web Application Security Solutions and Best Practices  Mobile Applications and Security  Security Threats and Vulnerabilities  National Approaches and Policies in Cyber Security  Cyberconflicts: Models and Deterrence Mechanisms  Deep Understanding of and Practical Skills in Software Security  Infusing Information Security into the Software-Development Life Cycle  Cloud Computing and Security  Government Cyber Security Strategy  Cyber Security Trends  Information Security Compliance, Regulations and Legislation  Security Policy Formulation and Implementation  Governance Risk and Compliance  Web/Internet Security    - Track 9: Emerging Trends and Technologies in ICT Application -    Web-based system  Green IT Technologies  Virtualization Concept  Social Applications  GIS and Remote Sensing  Distributed and Parallel Computing Information System Tools, Standards, Architectures, Platforms  Advanced database and Web Applications  Cloud Computing  Distributed Processing  Decision Support Systems  Concepts and Development of Information Systems  New SPI Models: SaaS, PaaS, IaaS, CaaS, XaaS  Location and mobility semantics  Social Network Analysis Methods and Applications  Context-aware Computing and Location-based Services  Web2 and Web3 new development paradigm  Web Ontology and Development  Semantic Web: Concepts, Technologies and Applications  Augmented Reality  Service Oriented Architechture    - Track 10: ICT in Business Administration, Governance, Finance and Economy -    ICT for micro/small businesses  e-Planning  Business process management, re-engineering and modelling  Metadata and public standards  Business Models and Economics of Community and Rural Wireless Networks  Internet as base of distributed business models  Location and Context Management  Data Science and Business Intelligence  Scientific fundament of e- and m-Commerce    - Track 11: ICT in Education and Research -    Human-Computer Challenge and Interaction  Public Access to Information and Globalization  Different Approaches to Implementation of ICT in S&T Education  Industry-University Partnership  Knowledge Management in e-Learning  Virtual Classrooms, and Universities  Learning & Content Management Systems  Mobile Learning Applications  e-Learning Platforms and Tools  Information Technologies in HE Management and Administration    - Track 12: ICT in Medicine and Health Care -    Healthcare Management Systems  Human-Machine Interfaces for Disabled Persons  Mobile technologies for Healthcare applications  Support for clinical decision-making  Design and development methodologies for Healthcare IT  e-Health and Telemedicine    - ICT in Fuel and Energy Industry -    Power systems and Automation  Thermal Power Engineering  Engineering Aspects of Alternative/Renewable Energy  Energy conservation and Energy efficient systems  Technology of production, exploration and operation in Fuel and Energy Industry  Fuzzy control in Fuel and Energy Industry  Neural networks in Fuel and Energy Industry  Integrated control and Diagnostics  Smart systems in Oil and Gas Technologies  Last updated by Dou Sun in 2021-03-07 "
    },
    {
        "conference": "BDE 2021: International Conference on Big Data Engineering",
        "website": "http://www.bde.net/",
        "deadline": [
            "2021-03-25"
        ],
        "extended": "Extended",
        "notice": [
            "2021-04-15"
        ],
        "begin": [
            "2021-05-29"
        ],
        "location": "Shanghai, China",
        "tag": "Viewed: 4928   Tracked: 10   Attend: 0",
        "call_for_papers": " The BDE 2021 organized by the ACM Singapore Chapter will present the most recent and exciting advances in Big Data Engineering through keynote talks. Prospective authors are invited to submit papers on relevant algorithms and applications including, but not limited to:    Big Data Science and Foundations  Novel Theoretical Models for Big Data  New Computational Models for Big Data  Data and Information Quality for Big Data  New Data Standards    Big Data Infrastructure  Cloud/Grid/Stream Computing for Big Data  High Performance/Parallel Computing Platforms for Big Data  Autonomic Computing and Cyber-infrastructure, System Architectures, Design and Deployment  Energy-efficient Computing for Big Data  Programming Models and Environments for Cluster, Cloud, and Grid Computing to Support Big Data  Software Techniques and Architectures in Cloud/Grid/Stream Computing  Big Data Open Platforms  New Programming Models for Big Data beyond Hadoop/MapReduce, STORM  Software Systems to Support Big Data Computing    Big Data Management  Search and Mining of variety of data including scientific and engineering, social, sensor/IoT/IoE, and multimedia data  Algorithms and Systems for Big Data Search  Distributed, and Peer-to-peer Search  Big Data Search Architectures, Scalability and Efficiency  Data Acquisition, Integration, Cleaning, and Best Practices  Visualization Analytics for Big Data  Computational Modeling and Data Integration  Large-scale Recommendation Systems and Social Media Systems  Cloud/Grid/Stream Data Mining- Big Velocity Data  Link and Graph Mining  Semantic-based Data Mining and Data Pre-processing  Mobility and Big Data  Multimedia and Multi-structured Data- Big Variety Data    Big Data Search and Mining  Social Web Search and Mining  Web Search  Algorithms and Systems for Big Data Search  Distributed, and Peer-to-peer Search  Big Data Search Architectures, Scalability and Efficiency  Data Acquisition, Integration, Cleaning, and Best Practices  Visualization Analytics for Big Data  Computational Modeling and Data Integration  Large-scale Recommendation Systems and Social Media Systems  Cloud/Grid/StreamData Mining- Big Velocity Data  Link and Graph Mining  Semantic-based Data Mining and Data Pre-processing  Mobility and Big Data  Multimedia and Multi-structured Data-Big Variety Data    Big Data Security, Privacy and Trust  Intrusion Detection for Gigabit Networks  Anomaly and APT Detection in Very Large Scale Systems  High Performance Cryptography  Visualizing Large Scale Security Data  Threat Detection using Big Data Analytics  Privacy Threats of Big Data  Privacy Preserving Big Data Collection/Analytics  HCI Challenges for Big Data Security & Privacy  User Studies for any of the above  Sociological Aspects of Big Data Privacy  Trust management in IoT and other Big Data Systems    Big Data Applications  Complex Big Data Applications in Science, Engineering, Medicine, Healthcare, Finance, Business, Law, Education, Transportation, Retailing, Telecommunication  Big Data Analytics in Small Business Enterprises (SMEs)  Big Data Analytics in Government, Public Sector and Society in General  Real-life Case Studies of Value Creation through Big Data Analytics  Big Data as a Service  Big Data Industry Standards  Experiences with Big Data Project Deployments  Last updated by Dunn Carl in 2021-02-26 "
    },
    {
        "conference": "ICKEA 2021: International Conference on Knowledge Engineering and Applications",
        "website": "http://www.ickea.org/",
        "deadline": [
            "2021-03-25"
        ],
        "extended": "Extended",
        "notice": [
            "2021-04-15"
        ],
        "begin": [
            "2021-06-04"
        ],
        "location": "Bangkok, Thailand",
        "tag": "Viewed: 4515   Tracked: 7   Attend: 0",
        "call_for_papers": " The Conference organizing committee invites researchers worldwide to submit papers and share the valuable experiences with the scientists from the world.    Knowledge Technology and Applications  Advanced Knowledge Technologies  Knowledge Relationship Discovery  Knowledge Representation and Reasoning  Knowledge Services  Knowledge Visualization  Learning organization & organizational learning  Metadata and structured documents  Ontology Engineering and Technology  Ontology matching and alignment  Ontology sharing and reuse  Organizational memories  Organizational semiotics  Process knowledge and semantic services  Semantic Web and Ontology  Social networks and the psychological dimension  Studies, metrics & benchmarks  Tools and technology for knowledge management  e-Learning, e-training and executive training  Decision support systems and intelligent systems    Human-Machine Interaction  Impact measurement of knowledge management  Innovative Approaches to Knowledge Management  Intelligent information systems  Intelligent multi-agent systems  Intelligent problem solving  Interoperability  K-Economy, k-community and k-enterprise  Knowledge acquisition  Knowledge Management and Projects  Knowledge Management strategies and implementations  Knowledge Reengineering  Business intelligence & Customer Relationship Management  Communication, collaboration and information sharing  Content management & digital rights management  Context modeling and management  Digital libraries, Archives and Repositories  Domain analysis and modeling  e-Business and interoperability issues  Last updated by Dou Sun in 2021-03-07 "
    },
    {
        "conference": "ICTDM 2021: International Conference on Communication Technology and Data Mining",
        "website": "http://www.ictdm.org/",
        "deadline": [
            "2021-03-25"
        ],
        "extended": "Extended",
        "notice": [
            "2021-04-15"
        ],
        "begin": [
            "2021-07-29"
        ],
        "location": "Hangzhou, China",
        "tag": "Viewed: 427   Tracked: 1   Attend: 0",
        "call_for_papers": " 2021  International Conference on Communication Technology and Data Mining (ICTDM 2021) is the premier forum for the presentation of new advances and research results in the fields of Communication Technology and Data Mining. The conference will bring together leading researchers, engineers and scientists in the domain of interest from around the world. Topics of interest for submission include, but are not limited to:    1.Communication Technology Topics:    Network and Wireless Communication  VLSI Circuits and Systems Design  Information Hiding and Watermarking  Multimedia  Network and Information Security  RF Front-End Circuits and Systems  Intelligent Mobile Device Design  Coding and Signal Processing  Wearable Technology  Microwave/MM-Wave/THz Circuits and Syste  Internet of Things and Big data  Computer Vision and Artificial Intelligence  5G Communication and Network  Green Communication Systems  Communication Device Modeling  EMC and Antenna Design  Others    2.Core Data Mining Topics:    Data Pre-Processing  Data Transformation and Dimensionality Reduction  Feature Extraction and Feature Selection  Data Mining Algorithms  Data Analytics Foundations  Real-time Mining, Data Stream Mining, and Dynamic Data Mining  Visual Mining and Data Visualization  Statistical Learning Theory and Neural Network Research  Graph Mining and Semi-Structured Data  Spatial and Temporal Data Mining  Uncertainty Modeling in Data Mining  Web Mining    3.Data Mining For Intelligent IT Application Topics:    Convergence of Data Mining and Intelligent IT Applications  How Data Mining Techniques have been used in IT Applications  Novel Applications of Intelligent IT Techniques for Complex Systems  Robustness and Scalability Issues of Intelligent IT Techniques  Agent-based Data Analysis and Knowledge Discovery  Intelligent Multi-gent Systems  Intrusion Detection and Access Control Techniques  Data-mining Applications for Terrorist Network Tracing  Crime Modeling, Fraud and Misuse Detection  Credit Scoring, Financial Modeling and Forecasting  CRM, e-Marketing and e-Commerce Recommender  Web Intelligence  Prediction Systems  Knowledge Management  Decision Analysis and Decision Support Systems  Industrial Applications of Business Analytics and Optimization  Performance Evaluation in Intelligent IT applications  Emerging Intelligent IT Applications and Lessons Learned  Last updated by Hana Liu in 2021-02-24 "
    },
    {
        "conference": "ATCES 2021: International Conference on Aerospace Technology, Communications and Energy Systems",
        "website": "https://www.atces.org/",
        "deadline": [
            "2021-03-25"
        ],
        "extended": "N/A",
        "notice": [
            "2021-04-25"
        ],
        "begin": [
            "2021-09-23"
        ],
        "location": "Shanghai, China",
        "tag": "Viewed: 3964   Tracked: 1   Attend: 0",
        "call_for_papers": " ATCES 2021 is the premier interdisciplinary forum for the presentation of new advances and research results in the fields of Aerospace Technology, Communications and Energy Systems. The conference will bring together leading academic scientists, researchers and scholars in the domain of interest from around the world. The topics of conference are included below, but not limited to :    Aerospace Technology      Aircraft Structure and Design;    Spacecraft Structure and Design;  Aircraft Manufacturing Technology;    Aerospace Engineering;  Aerodynamics;    Reliability issues of engines, power supply units and their systems;  Development prospects and use of engines for aviation, rocket and space systems, automotive engineering and stationary power supply units;    Computer-aided design, engineering and manufacturing in engines development;  Re-engineering of aircraft engines;    Operation processes and engines theory;  Environmental issues for aviation, energy development and space booster;    Production and advanced technologies of propulsion engineering;  Power units and supply systems control;    Aerospace Systems and Technology;  Aerodynamics and Aeroelasticity;    Aerospace Dynamics and Controls;  Aerospace Propulsion; Aerospace Structures;    Aerospace Design, Testing, and Performance;  Airworthiness and Certifications;    Experimental Methods and Measurements;  UAV and MAV;    Flight Systems;  Aircraft Structure and Design;    Spacecraft Structure and Design;    Communications      Communication Networks;    Wireless Communications;  Mobile Communications;    Infrastructure;  Next Generation Networks;    Information & Communication;  Coding Theory;    Optical Communications;  Internet Technologies;    Communication Software;  Sensor Networks; New;    Communication Technologies;  Visual Arts & Visual Communication Design;    Marketing Communication;  Green Communication;    Communication Systems;  Telecommunication Technologies;    Data Communications;  Information Technology Application;    Satellite Communication;  Network Security;    DSP Algorithms & Architectures;    Energy Systems      Modern Energy Systems and Power Electronics;    Renewable Energy Systems and Distributed Generation;  Renewable Energy Systems;    Hybrid Power Systems;  Intelligent Control for Renewable;    Energy Systems;  Maximum Power Point Tracking (MPPT);    Power Electronics in Distributed Generation;  Intelligent and Adaptive Systems in Smart Grid;    Power System Management;  Last updated by Dou Sun in 2020-10-17 "
    },
    {
        "conference": "WiSec 2021: ACM Conference on Security and Privacy in Wireless and Mobile Networks",
        "website": "https://sites.nyuad.nyu.edu/wisec21/",
        "deadline": [
            "2021-03-25"
        ],
        "extended": "Extended",
        "notice": [
            "2021-04-29"
        ],
        "begin": [
            "2021-06-28"
        ],
        "location": "Online",
        "tag": "CCF: c   QUALIS: b1   Viewed: 20082   Tracked: 54   Attend: 7",
        "call_for_papers": " The 14th ACM Conference on Security and Privacy in Wireless and Mobile Networks (ACM WiSec 2021) will be held virtually from June 28 to July 1, 2021.    ACM WiSec is the leading ACM and SIGSAC conference dedicated to all aspects of security and privacy in wireless and mobile networks and their applications. In addition to the traditional ACM WiSec topics of physical, link, and network layer security, we welcome papers focusing on the increasingly diverse range of mobile or wireless applications such as Internet of Things, Cyber-Physical Systems, as well as the security and privacy of mobile software platforms, usable security and privacy, biometrics, and cryptography.    The conference welcomes both theoretical as well as systems contributions. Topics of interest include, but are not limited to        Cryptographic primitives for wireless and mobile security      Data-driven security attacks and countermeasures      Economics of mobile security and privacy      Jamming attacks and defenses      Key management (agreement or distribution) for wireless or mobile systems      Lightweight cryptography primitives and protocols      Mobile malware and platform security      NFC and smart payment applications      Next generation cellular network fraud and security      Physical tracking security and privacy      Resilience and dependability for mobile and wireless networks      Reverse engineering of and tampering with mobile applications      Security and privacy for cognitive radio and dynamic spectrum access systems      Security and privacy for mobile applications (e.g., mobile sensing systems)      Security and privacy for smart devices (e.g., smartphones)      Secure localization and location privacy      Security protocols for wireless networking      Side-channel and fault attacks on smart devices      Side-channel attacks on mobile and wearable systems      Theoretical and formal approaches for wireless and mobile security      Usable mobile security and privacy      Vehicular networks security (e.g., drones, automotive, avionics, autonomous driving)      Wireless and mobile privacy and anonymization techniques      Wireless or mobile security for cyber-physical systems (e.g, healthcare, smart grid) and IoT systems      Wireless network security for critical infrastructures    The proceedings of ACM WiSec, sponsored by SIGSAC, will be published by the ACM.  Last updated by Dou Sun in 2021-03-20 "
    },
    {
        "conference": "PaCT' 2021: International Conference on Parallel Computing Technologies",
        "website": "http://ssd.sscc.ru/conference/pact2021/",
        "deadline": [
            "2021-03-25"
        ],
        "extended": "N/A",
        "notice": [
            "2021-05-14"
        ],
        "begin": [
            "2021-09-13"
        ],
        "location": "Kaliningrad, Russia",
        "tag": "Viewed: 7392   Tracked: 0   Attend: 0",
        "call_for_papers": " The Institute of Computational Mathematics and Mathematical Geophysics (Russian Academy of Sciences, Novosibirsk, Russia), Immanuel Kant Baltic Federal University, Novosibirsk State University, and Novosibirsk State Technical University are jointly organizing the 16th International Conference on Parallel Computing Technologies (PaCT-2021) to be held in Kalininrad, Russia, September 13-18, 2021.    The proceedings of previous PaCT conferences are available as volumes of Lecture Notes in Computer Science series (Springer) since 1995: https://link.springer.com/conference/pact.     The aim of the PaCT-2021 is to give an overview of new developments, applications, and trends in parallel computing technologies. We sincerely hope that the conference will help our community to deepen understanding of parallel computing technologies by providing a forum for an exchange of views between scientists and specialists from all over the world. We welcome your active participation.    Main topics        All technological aspects of the applications of parallel computer systems      High level parallel programming languages and systems      Methods and tools for parallel solution of large-scale problems      Languages, environments and software tools supporting parallel processing      Operating systems, scheduling, mapping, load balancing      General architectural concepts      Cellular automata      Performance measurement and analysis tools      Active knowledge and program construction      Software for grid and cloud computing      Scalable computing      Fragmentation and aggregation of algorithms and programs      Programs assembling and reuse      Distributed algorithms  Last updated by Dou Sun in 2021-03-06 "
    },
    {
        "conference": "INTERSPEECH 2021: Conference of the International Speech Communication Association",
        "website": "https://www.interspeech2021.org/",
        "deadline": [
            "2021-03-26"
        ],
        "extended": "N/A",
        "notice": [
            "2021-06-02"
        ],
        "begin": [
            "2021-08-30"
        ],
        "location": "Brno, Czechia",
        "tag": "CCF: c   Viewed: 34728   Tracked: 27   Attend: 4",
        "call_for_papers": " INTERSPEECH is the world’s largest and most comprehensive conference on the science and technology of spoken language processing. INTERSPEECH conferences emphasize interdisciplinary approaches addressing all aspects of speech science and technology, ranging from basic theories to advanced applications.    The theme of INTERSPEECH 2021 held in Brno, Czechia, is “Speech everywhere”. Speech is also becoming an indispensable part of all AI systems and no longer considered an isolated block. We are seeing the emergence of larger systems that treat speech, vision, language, interfaces, external knowledge in an integrated way, and learn multi-modal embeddings, or otherwise jointly optimize performance. “Speech everywhere” also requires speech engineering to become more aware of the principles of human speech communication processes, and we therefore specifically encourage contributions in human speech processing.    In addition to regular oral and poster sessions, INTERSPEECH 2021 will feature plenary talks by internationally renowned experts, tutorials, special sessions and challenges, show & tell sessions, and exhibits. A number of satellite events will also take place around INTERSPEECH 2021.    Paper Submission    Papers intended for INTERSPEECH 2021 should be up to four pages of text. An optional fifth page can be used for references only. Paper submissions must conform to the format defined in the paper preparation guidelines and as detailed in the author’s kit on the conference webpage. Submissions may also be accompanied by additional files such as multimedia files. Authors must declare that their contributions are original and have not been submitted elsewhere for publication. Papers must be submitted via the online paper submission system. The working language of the conference is English, and papers must be written in English.    Scientific Area Topics    Original papers are solicited in, but not limited to, the following areas:        Speech Perception, Production and Acquisition      Phonetics, Phonology, and Prosody      Analysis of Paralinguistics in Speech and Language      Speaker and Language Identification      Analysis of Speech and Audio Signals      Speech Coding and Enhancement      Speech Synthesis and Spoken Language Generation      Speech Recognition — Signal Processing, Acoustic Modeling, Robustness, Adaptation      Speech Recognition — Architecture, Search, and Linguistic Components      Speech Recognition — Technologies and Systems for New Applications      Spoken Dialog Systems and Analysis of Conversation      Spoken Language Processing — Translation, Information Retrieval, Summarization, Resources and Evaluation      Speech, voice, and hearing disorders (Please note this new area!)  Last updated by Dou Sun in 2021-01-03 "
    },
    {
        "conference": "EW 2021: European Wireless",
        "website": "https://ew2020.european-wireless.org/",
        "deadline": [
            "2021-03-27"
        ],
        "extended": "Extended",
        "notice": [
            "2021-04-30"
        ],
        "begin": [
            "2021-11-10"
        ],
        "location": "Verona, Italy",
        "tag": "Viewed: 1799   Tracked: 0   Attend: 0",
        "call_for_papers": " European Wireless (EW) is a key venue for European and worldwide researchers to be acquainted with the latest trends in wireless communications and networking. The 26th edition of EW (EW 2020) will be held in Verona, Italy, in May 5-7, 2021. The main theme of EW 2020 is “Virtualization paradigms and satellite integration in future generation wireless communications”.    Topics of interest include, but are not limited to, the following:    Radio Access Network and Backhaul/Fronthaul        Design of mmWave radio access for 5G and beyond      Low-cost radio, full-duplex, scalable, sustainable, low-complexity access systems      Mobile base stations based on UAVs and drones for 5GB      Optimization and resource allocation      Channel modeling and propagation      Modulation & coding      Interference management, localization and positioning      Error-correcting codes for 5G and beyond      Internet of Things      Virtualization of radio access network      Slicing of wireless virtual resources      Cloud radio access network      Fundamental limits, information theory for wireless      Wired-wireless integration      Ultra-Wideband Communications      Optical wireless and visible light communications      Energy efficient and Green communications      Emerging concepts: machine learning, big data analytics and information processing, programmable surfaces for wireless transmissions, molecular communications      Testbeds for future generation radio access networks      Mobility management and billing technologies    Edge and Core Network        Protocols and architectures, and resource allocation      Metrics for quality-of-service (QoS) and quality-of-experience (QoE)      Network coding      Mobile Edge Cloud      Distributed computing and distributed storage      SDN-NFV and virtual network resource slicing      Distributed caching, multi-tenancy, cloud computing and edge computing      Machine learning for edge and core future generations networks. Autonomic networks      Application layer: Mobile apps and platforms, emerging applications in wireless networks      Quantum communications, protocols and quantum Internet    Satellite-5G integration        AI and Machine Learning for SatCom      Coding, modulation and synchronization      Multiple Access techniques      MIMO, multi-user detection & diversity techniques      Fading and interference mitigation techniques      Network slicing      Radio Resource Management      Smart on-board processing techniques      MEC schemes for integrated 5G-satellite networks      SDN/NFV for integrated 5G-satellite networks      Very/Ultra High Throughput Satellites      Optical feeder links      Massive M2M/IoT over satellite      Swarm of nano and pico satellites technologies      Mega Constellations      NTN Standardisation within 3GPP      Satellite demonstrations and trials      Big Data over Satellite    5G and Beyond Verticals and Services        Tactile internet, ultra-low latency communications, ultra-reliable communications      Internet of Things, machine-type communications      Smart cities      Vehicular communications      Industry views on future wireless networks      Regional visions and requirements for future networks    Wireless Security        Security and Privacy      Physical-Layer Security for 5G and Beyond      Cyber-Physical Systems      Secure solutions for SDN and NFV    In addition, you can submit a paper to the EW2020 Special Sessions HERE!    EW 2020 is committed to the highest publication and ethical standards through a rigorous single-blind peer-review process. Submitted manuscripts must be original and not be published or under review elsewhere. Papers must not infringe any copyright or third party right. The proceedings of EW 2020 will be published and will be made available on IEEE Xplore.  Last updated by Dou Sun in 2021-02-28 "
    },
    {
        "conference": "JSE 2021: International Conference on Software Engineering and Applications",
        "website": "https://cst2021.org/jse/index",
        "deadline": [
            "2021-03-27"
        ],
        "extended": "Extended",
        "notice": [
            "2021-05-20"
        ],
        "begin": [
            "2021-12-23"
        ],
        "location": "Sydney, Australia",
        "tag": "Viewed: 2719   Tracked: 0   Attend: 0",
        "call_for_papers": " 10th International Conference on Software Engineering and Applications (JSE 2021)    December 23 ~ 24, 2021, Sydney, Australia    https://cst2021.org/jse/index    Scope & Topics    10th International Conference on Software Engineering and Applications (JSE 2021) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications of Software Engineering and Applications. The goal of this Conference is to bring together researchers and practitioners from academia and industry to focus on understanding Modern software engineering concepts and establishing new collaborations in these areas.    Authors are solicited to contribute to the Conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of software engineering & applications.    Topics of interest include, but are not limited to, the following       • The Software Process  • Software Engineering Practice  • Web Engineering  • Quality Management  • Managing Software Projects  • Advanced Topics in Software Engineering  • Multimedia and Visual Software Engineering  • Software Maintenance and Testing  • Languages and Formal Methods  • Web-based Education Systems and Learning Applications  • Software Engineering Decision Making  • Knowledge-based Systems and Formal Methods     Paper Submission    Authors are invited to submit papers through the conference Submission System by March 27, 2021. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed).    Selected papers from JSE 2021, after further revisions, will be published in the special issue of the following journal.    • International Journal of Software Engineering & Applications (IJSEA) - ERA Indexed  • Computer Science & Engineering: An International Journal (CSEIJ)  • Advanced Computing: An International Journal (ACIJ)  • International Journal of Information Sciences and Techniques (IJIST)  • International Journal of Computer Science, Engineering and Information Technology (IJCSEIT)  • International Journal in Foundations of Computer Science & Technology (IJFCST)  • International Journal of Information Technology, Control and Automation (IJITCA)    Important Dates    • Submission Deadline : March 27, 2021  • Authors Notification : May 20, 2021  • Registration & Camera-Ready Paper Due : June 02, 2021    Contact Us    Here's where you can reach us: jse@cst2021.org or jseconf@yahoo.com    Submission System    https://cst2021.org/submission/index.php    Last updated by Richert Kevin in 2021-03-16 "
    },
    {
        "conference": "NLP 2021: International Conference on Natural Language Processing",
        "website": "https://cst2021.org/nlp/index",
        "deadline": [
            "2021-03-27"
        ],
        "extended": "Extended",
        "notice": [
            "2021-05-20"
        ],
        "begin": [
            "2021-12-23"
        ],
        "location": "Sydney, Australia",
        "tag": "Viewed: 2842   Tracked: 2   Attend: 0",
        "call_for_papers": " 10th International Conference on Natural Language Processing (NLP 2021)    December 23 ~ 24, 2021, Sydney, Australia    https://cst2021.org/nlp/index    Scope & Topics    10th International Conference on Natural Language Processing (NLP 2021) is a programmed approach to analyze text that is based on both a set of theories and a set of technologies. This forum aims to bring together researchers who have designed and build software that will analyze, understand, and generate languages that humans use naturally to address computers.    Authors are solicited to contribute to the Conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of Natural Language Processing.    Topics of interest include, but are not limited to, the following       • Algorithms and Data Structures  • Phonology, Morphology  • Chunking/Shallow Parsing  • Parsing/Grammatical Formalisms  • Semantic Processing  • Lexical Semantics  • Ontology  • Linguistic Resources  • Statistical and Knowledge based methods  • POS tagging  • Discourse  • Paraphrasing/Entailment/Generation  • Machine Translation  • Information Retrieval  • Text Mining  • Information Extraction  • Question Answering  • Dialog Systems  • Spoken Language Processing  • Speech Recognition and Synthesis    Paper Submission    Authors are invited to submit papers through the conference Submission System by March 27, 2021. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed).    Selected papers from NLP 2021, after further revisions, will be published in the special issue of the following journal.    • International Journal on Computational Science & Applications (IJCSA)  • International Journal on Natural Language Computing (IJNLC)  • International Journal of Web & Semantic Technology (IJWesT)    Important Dates    • Submission Deadline : March 27, 2021  • Authors Notification : May 20, 2021  • Registration & Camera-Ready Paper Due : June 02, 2021    Contact Us    Here's where you can reach us: nlp@cst2021.org or nlp.conf@yahoo.com  Submission System    https://cst2021.org/submission/index.php    Last updated by Richert Kevin in 2021-03-16 "
    },
    {
        "conference": "VLSIE 2021: International Conference on VLSI & Embedded Systems",
        "website": "https://cst2021.org/vlsie/index",
        "deadline": [
            "2021-03-27"
        ],
        "extended": "Extended",
        "notice": [
            "2021-05-20"
        ],
        "begin": [
            "2021-12-23"
        ],
        "location": "Sydney, Australia",
        "tag": "Viewed: 1024   Tracked: 0   Attend: 1",
        "call_for_papers": " 2nd International Conference on VLSI & Embedded Systems (VLSIE 2021)    December 23 ~ 24, 2021, Sydney, Australia    https://cst2021.org/vlsie/index  Scope & Topics    2nd International Conference on VLSI & Embedded Systems (VLSIE 2021) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications of VLSI and Embedded Systems. Original, unpublished papers, describing research in the general area of VLSI and Embedded Systems are solicited. Both theoretical and experimental research results are welcome in the following areas, but are not limited to.  Authors are solicited to contribute to the Conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of Computer Science & Technology.    Topics of interest include, but are not limited to, the following       VLSI    • VLSI Design  • VLSI Circuits  • Computer-Aided Design (CAD)  • Low Power and Power Aware Design  • Testing, Reliability, Fault-Tolerance  • Emerging Technologies  • Post-CMOS VLSI  • VLSI Applications (Communications, Video, Security, Sensor Networks, etc)  • Microarchitecture Design  • Digital Integrated Circuits and Systems  • Biomedical Circuits and Healthcare Systems  • Electronic Design Automation  • Security and Privacy  • Emerging Technologies and new age Nano electronics  • Analog and Mixed-Signal Design/RF Circuit Design  Embedded Systems    • Application-specific processors and devices  • Business Applications  • Component and binding models  • Embedded computing education  • Embedded hardware support  • Embedded software  • Embedded system architecture  • Hardware and software co-design  • Industrial practices and benchmark suites  • Integration with business logic  • Integration with SOA  • Middleware  • Networked Embedded Systems  • Policy-based management  • Programming abstractions  • Real-time systems  • Recent Trends  • Service-Oriented architectures  • Testing techniques   • Artificial Intelligence and Machine                         Paper Submission    Authors are invited to submit papers through the conference Submission System by March 27, 2021. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed).    Selected papers from VLSIE 2021, after further revisions, will be published in the special issues of the following journals  • Signal & Image Processing: An International Journal (SIPIJ)  • International Journal of VLSI Design & Communication Systems (VLSICS)  • International Journal of Embedded Systems and Applications (IJESA)  • Information Technology in Industry ITII)New – ESCI(WOS)Indexed    Important Dates    • Submission Deadline: March 27,2021  • Notification: May 20,2021  • Final Manuscript Due: June 02, 2021    Contact Us    Here's where you can reach us :vlsie@cst2021.org or vlsieconf@yahoo.com     Submission System link: https://cst2021.org/submission/index.php          Last updated by Richert Kevin in 2021-03-15 "
    },
    {
        "conference": "NeTIOT 2021: International Conference on Networks & IOT",
        "website": "https://cst2021.org/netiot/index",
        "deadline": [
            "2021-03-27"
        ],
        "extended": "Extended",
        "notice": [
            "2021-05-20"
        ],
        "begin": [
            "2021-12-23"
        ],
        "location": "Sydney, Australia",
        "tag": "Viewed: 838   Tracked: 0   Attend: 0",
        "call_for_papers": " 2nd International Conference on Networks & IOT (NeTIOT 2021)    December 23 ~ 24, 2021, Sydney, Australia    https://cst2021.org/netiot/index  Scope & Topics    2nd International Conference on Networks & IOT (NeTIOT 2021) will provide an excellent international forum for sharing knowledge and results in theory, methodology and applications of Computer Networks & IOT. The aim of the conference is to provide a platform to the researchers and practitioners from both academia as well as industry to meet and share cutting-edge development in the field.  Authors are solicited to contribute to the Conference by submitting articles that illustrate research results, projects, surveying works and industrial experiences that describe significant advances in the areas of Computer Science & Technology.    Topics of interest include, but are not limited to, the following      • Deep Learning  • Learning in knowledge-intensive systems  • Addressing and Location Management  • Broadband Access Technologies  • Adhoc and Sensor Networks  • Cross Layer Design and Optimization  • Heterogeneous Wireless Networks  • High Speed Networks  • Internet and Web Applications  • Measurement & Performance Analysis  • Mobile & Broadband Wireless Internet  • Mobile Networks & Wireless LAN  • Network Architectures  • Network Based Applications  • Network Protocols & Wireless Networks  • Network Operations & Management  • Network Security Trust, & Privacy  • Next Generation Internet & Web Architectures  • Peer to Peer and Overlay Networks  • QOS And Resource Management  • Recent Trends & Developments in Computer Networks  • Routing, Switching and Addressing Techniques  • Self-Organizing Networks and Networked Systems  • Ubiquitous Networks  • Virtual & Overlay Networks  • Wireless & Mobile Networks  • Wireless Communications  • Wireless Mesh Networks and Protocols  • Wireless Multimedia Systems  • Network and Communications Security  • Graph Theory in Wireless Ad hoc Networks and Sensor Networks  • Security and Privacy for IoT  • IoT-enabled Innovation and Entrepreneurship  • IoT Applications and Services  • Experimental Results and Deployment Scenarios  • Electronics and Signal processing for IoT  • Connectivity and Networking    Paper Submission    Authors are invited to submit papers through the conference Submission System by March 27, 2021. Submissions must be original and should not have been published previously or be under consideration for publication while being evaluated for this conference. The proceedings of the conference will be published by Computer Science Conference Proceedings in Computer Science & Information Technology (CS & IT) series (Confirmed).    Selected papers from NeTIOT 2021, after further revisions, will be published in the special issues of the following journals  • International Journal of Computer Networks & Communication (IJCNC) – Scopus Indexed, ERA Indexed  • International Journal of Network Security & Its Applications (IJNSA)- ERA Indexed  • International Journal of Wireless & Mobile Networks (IJWMN)- ERA Indexed  • International Journal of Next-Generation Networks (IJNGN)  • International Journal of Ubiquitous Computing (IJU)  • International Journal on Applications of Graph Theory in Wireless Ad hoc Networks and Sensor Networks (GRAPH-HOC)    Important Dates    • Submission Deadline: March 27,2021  • Notification: May 20,2021  • Final Manuscript Due: June 02, 2021    Contact Us    Here's where you can reach us :netiot@cst2021.org or netiotconf@yahoo.com       Submission System link: https://cst2021.org/submission/index.php          Last updated by Richert Kevin in 2021-03-15 "
    }
]